; ModuleID = '__uClibc_main.os'
source_filename = "libc/misc/internals/__uClibc_main.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

module asm ".section .gnu.warning.__fpending"
module asm "\09.previous"

%struct.__uclibc_locale_struct.203 = type { i16*, i16*, i16*, [384 x i16], [384 x i16], [384 x i16], [14 x i8], [6 x i16], [6 x i8], i8, i8, [10 x i8], i8*, i8*, i8*, i8*, i8*, i16*, i8*, i8*, i16*, i8*, i8*, i16*, i32, i32, i32, i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct.__collate_t.202 }
%struct.__collate_t.202 = type { i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16 }
%struct.__STDIO_FILE_STRUCT.570 = type { i16, [2 x i8], i32, i8*, i8*, i8*, i8*, i8*, i8*, %struct.__STDIO_FILE_STRUCT.570*, [2 x i32], %struct.timezone, i8* }
%struct.timezone = type { i32, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.exe_sym_env_t = type { [32 x %struct.exe_file_t], i32, i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__libc_stack_end", scope: !2, file: !3, line: 52, type: !6, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !26)
!3 = !DIFile(filename: "libc/misc/internals/__uClibc_main.c", directory: "/home/strahinja/build/klee-uclibc")
!4 = !{}
!5 = !{!6, !7, !9, !11, !23, !25}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_auxv_t", file: !13, line: 1036, baseType: !14)
!13 = !DIFile(filename: "./include/elf.h", directory: "/home/strahinja/build/klee-uclibc")
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 1026, size: 128, elements: !15)
!15 = !{!16, !19}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "a_type", scope: !14, file: !13, line: 1028, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !18, line: 58, baseType: !10)
!18 = !DIFile(filename: "./include/stdint.h", directory: "/home/strahinja/build/klee-uclibc")
!19 = !DIDerivedType(tag: DW_TAG_member, name: "a_un", scope: !14, file: !13, line: 1035, baseType: !20, size: 64, offset: 64)
!20 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !14, file: !13, line: 1029, size: 64, elements: !21)
!21 = !{!22}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "a_val", scope: !20, file: !13, line: 1031, baseType: !17, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !24, line: 62, baseType: !10)
!24 = !DIFile(filename: "/usr/lib/llvm-6.0/lib/clang/6.0.0/include/stddef.h", directory: "/home/strahinja/build/klee-uclibc")
!25 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!26 = !{!0, !27, !31, !33, !35, !38, !40, !46, !49}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "__uclibc_progname", scope: !2, file: !3, line: 110, type: !29, isLocal: false, isDefinition: true)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "program_invocation_short_name", scope: !2, file: !3, line: 112, type: !29, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "program_invocation_name", scope: !2, file: !3, line: 113, type: !29, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "__environ", scope: !2, file: !3, line: 125, type: !37, isLocal: false, isDefinition: true)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(name: "__pagesize", scope: !2, file: !3, line: 129, type: !23, isLocal: false, isDefinition: true)
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(name: "been_there_done_that", scope: !42, file: !3, line: 189, type: !45, isLocal: true, isDefinition: true)
!42 = distinct !DISubprogram(name: "__uClibc_init", scope: !3, file: !3, line: 187, type: !43, isLocal: false, isDefinition: true, scopeLine: 188, flags: DIFlagPrototyped, isOptimized: false, unit: !2, variables: !4)
!43 = !DISubroutineType(types: !44)
!44 = !{null}
!45 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "__app_fini", scope: !2, file: !3, line: 244, type: !48, isLocal: false, isDefinition: true)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!49 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression())
!50 = distinct !DIGlobalVariable(name: "__rtld_fini", scope: !2, file: !3, line: 247, type: !48, isLocal: false, isDefinition: true)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "n_calls", scope: !53, file: !54, line: 1342, type: !45, isLocal: true, isDefinition: true)
!53 = distinct !DISubprogram(name: "getcwd", scope: !54, file: !54, line: 1341, type: !55, isLocal: false, isDefinition: true, scopeLine: 1341, flags: DIFlagPrototyped, isOptimized: false, unit: !59, variables: !4)
!54 = !DIFile(filename: "/home/strahinja/repo/klee/runtime/POSIX/fd.c", directory: "/home/strahinja/repo/runtime/POSIX")
!55 = !DISubroutineType(types: !56)
!56 = !{!7, !7, !57}
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !58, line: 62, baseType: !10)
!58 = !DIFile(filename: "/usr/lib/llvm-6.0/lib/clang/6.0.0/include/stddef.h", directory: "/home/strahinja/repo/runtime/POSIX")
!59 = distinct !DICompileUnit(language: DW_LANG_C89, file: !54, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !60, retainedTypes: !80, globals: !140)
!60 = !{!61, !68}
!61 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !62, line: 46, size: 32, elements: !63)
!62 = !DIFile(filename: "/home/strahinja/repo/klee/runtime/POSIX/fd.h", directory: "/home/strahinja/repo/runtime/POSIX")
!63 = !{!64, !65, !66, !67}
!64 = !DIEnumerator(name: "eOpen", value: 1)
!65 = !DIEnumerator(name: "eCloseOnExec", value: 2)
!66 = !DIEnumerator(name: "eReadable", value: 4)
!67 = !DIEnumerator(name: "eWriteable", value: 8)
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !69, line: 97, size: 32, elements: !70)
!69 = !DIFile(filename: "/usr/include/dirent.h", directory: "/home/strahinja/repo/runtime/POSIX")
!70 = !{!71, !72, !73, !74, !75, !76, !77, !78, !79}
!71 = !DIEnumerator(name: "DT_UNKNOWN", value: 0)
!72 = !DIEnumerator(name: "DT_FIFO", value: 1)
!73 = !DIEnumerator(name: "DT_CHR", value: 2)
!74 = !DIEnumerator(name: "DT_DIR", value: 4)
!75 = !DIEnumerator(name: "DT_BLK", value: 6)
!76 = !DIEnumerator(name: "DT_REG", value: 8)
!77 = !DIEnumerator(name: "DT_LNK", value: 10)
!78 = !DIEnumerator(name: "DT_SOCK", value: 12)
!79 = !DIEnumerator(name: "DT_WHT", value: 14)
!80 = !{!81, !6, !82, !10, !86, !7, !101, !45, !8}
!81 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "off64_t", file: !83, line: 93, baseType: !84)
!83 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/strahinja/repo/runtime/POSIX")
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !85, line: 141, baseType: !81)
!85 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/strahinja/repo/runtime/POSIX")
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent64", file: !88, line: 37, size: 2240, elements: !89)
!88 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "/home/strahinja/repo/runtime/POSIX")
!89 = !{!90, !92, !93, !95, !97}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !87, file: !88, line: 39, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !85, line: 137, baseType: !10)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !87, file: !88, line: 40, baseType: !84, size: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !87, file: !88, line: 41, baseType: !94, size: 16, offset: 128)
!94 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !87, file: !88, line: 42, baseType: !96, size: 8, offset: 144)
!96 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !87, file: !88, line: 43, baseType: !98, size: 2048, offset: 152)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 2048, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 256)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !103, line: 46, size: 1152, elements: !104)
!103 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "/home/strahinja/repo/runtime/POSIX")
!104 = !{!105, !107, !109, !111, !114, !116, !118, !119, !120, !122, !124, !126, !134, !135, !136}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !102, file: !103, line: 48, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !85, line: 133, baseType: !10)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !102, file: !103, line: 53, baseType: !108, size: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !85, line: 136, baseType: !10)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !102, file: !103, line: 61, baseType: !110, size: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !85, line: 139, baseType: !10)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !102, file: !103, line: 62, baseType: !112, size: 32, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !85, line: 138, baseType: !113)
!113 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !102, file: !103, line: 64, baseType: !115, size: 32, offset: 224)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !85, line: 134, baseType: !113)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !102, file: !103, line: 65, baseType: !117, size: 32, offset: 256)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !85, line: 135, baseType: !113)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !102, file: !103, line: 67, baseType: !45, size: 32, offset: 288)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !102, file: !103, line: 69, baseType: !106, size: 64, offset: 320)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !102, file: !103, line: 74, baseType: !121, size: 64, offset: 384)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !85, line: 140, baseType: !81)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !102, file: !103, line: 78, baseType: !123, size: 64, offset: 448)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !85, line: 162, baseType: !81)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !102, file: !103, line: 80, baseType: !125, size: 64, offset: 512)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !85, line: 167, baseType: !81)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !102, file: !103, line: 91, baseType: !127, size: 128, offset: 576)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !128, line: 8, size: 128, elements: !129)
!128 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "/home/strahinja/repo/runtime/POSIX")
!129 = !{!130, !132}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !127, file: !128, line: 10, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !85, line: 148, baseType: !81)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !127, file: !128, line: 11, baseType: !133, size: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !85, line: 184, baseType: !81)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !102, file: !103, line: 92, baseType: !127, size: 128, offset: 704)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !102, file: !103, line: 93, baseType: !127, size: 128, offset: 832)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !102, file: !103, line: 106, baseType: !137, size: 192, offset: 960)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 192, elements: !138)
!138 = !{!139}
!139 = !DISubrange(count: 3)
!140 = !{!141, !146, !153, !160, !166, !171, !51}
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(name: "n_calls", scope: !143, file: !54, line: 313, type: !45, isLocal: true, isDefinition: true)
!143 = distinct !DISubprogram(name: "close", scope: !54, file: !54, line: 312, type: !144, isLocal: false, isDefinition: true, scopeLine: 312, flags: DIFlagPrototyped, isOptimized: false, unit: !59, variables: !4)
!144 = !DISubroutineType(types: !145)
!145 = !{!45, !45}
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(name: "n_calls", scope: !148, file: !54, line: 345, type: !45, isLocal: true, isDefinition: true)
!148 = distinct !DISubprogram(name: "read", scope: !54, file: !54, line: 344, type: !149, isLocal: false, isDefinition: true, scopeLine: 344, flags: DIFlagPrototyped, isOptimized: false, unit: !59, variables: !4)
!149 = !DISubroutineType(types: !150)
!150 = !{!151, !45, !6, !57}
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !83, line: 109, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !85, line: 181, baseType: !81)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "n_calls", scope: !155, file: !54, line: 411, type: !45, isLocal: true, isDefinition: true)
!155 = distinct !DISubprogram(name: "write", scope: !54, file: !54, line: 410, type: !156, isLocal: false, isDefinition: true, scopeLine: 410, flags: DIFlagPrototyped, isOptimized: false, unit: !59, variables: !4)
!156 = !DISubroutineType(types: !157)
!157 = !{!151, !45, !158, !57}
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "n_calls", scope: !162, file: !54, line: 642, type: !45, isLocal: true, isDefinition: true)
!162 = distinct !DISubprogram(name: "chmod", scope: !54, file: !54, line: 641, type: !163, isLocal: false, isDefinition: true, scopeLine: 641, flags: DIFlagPrototyped, isOptimized: false, unit: !59, variables: !4)
!163 = !DISubroutineType(types: !164)
!164 = !{!45, !29, !165}
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !83, line: 70, baseType: !112)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "n_calls", scope: !168, file: !54, line: 661, type: !45, isLocal: true, isDefinition: true)
!168 = distinct !DISubprogram(name: "fchmod", scope: !54, file: !54, line: 660, type: !169, isLocal: false, isDefinition: true, scopeLine: 660, flags: DIFlagPrototyped, isOptimized: false, unit: !59, variables: !4)
!169 = !DISubroutineType(types: !170)
!170 = !{!45, !45, !165}
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(name: "n_calls", scope: !173, file: !54, line: 747, type: !45, isLocal: true, isDefinition: true)
!173 = distinct !DISubprogram(name: "__fd_ftruncate", scope: !54, file: !54, line: 746, type: !174, isLocal: false, isDefinition: true, scopeLine: 746, flags: DIFlagPrototyped, isOptimized: false, unit: !59, variables: !4)
!174 = !DISubroutineType(types: !175)
!175 = !{!45, !45, !82}
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(name: "__global_locale_data", scope: !178, file: !213, line: 375, type: !452, isLocal: false, isDefinition: true)
!178 = distinct !DICompileUnit(language: DW_LANG_C99, file: !179, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !180, retainedTypes: !202, globals: !255)
!179 = !DIFile(filename: "libc/misc/locale/_locale_init.c", directory: "/home/strahinja/build/klee-uclibc")
!180 = !{!181, !187}
!181 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !182, line: 90, size: 32, elements: !183)
!182 = !DIFile(filename: "./include/bits/uClibc_locale.h", directory: "/home/strahinja/build/klee-uclibc")
!183 = !{!184, !185, !186}
!184 = !DIEnumerator(name: "__ctype_encoding_7_bit", value: 0)
!185 = !DIEnumerator(name: "__ctype_encoding_utf8", value: 1)
!186 = !DIEnumerator(name: "__ctype_encoding_8_bit", value: 2)
!187 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !188, line: 48, size: 32, elements: !189)
!188 = !DIFile(filename: "./include/ctype.h", directory: "/home/strahinja/build/klee-uclibc")
!189 = !{!190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201}
!190 = !DIEnumerator(name: "_ISupper", value: 256)
!191 = !DIEnumerator(name: "_ISlower", value: 512)
!192 = !DIEnumerator(name: "_ISalpha", value: 1024)
!193 = !DIEnumerator(name: "_ISdigit", value: 2048)
!194 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!195 = !DIEnumerator(name: "_ISspace", value: 8192)
!196 = !DIEnumerator(name: "_ISprint", value: 16384)
!197 = !DIEnumerator(name: "_ISgraph", value: 32768)
!198 = !DIEnumerator(name: "_ISblank", value: 1)
!199 = !DIEnumerator(name: "_IScntrl", value: 2)
!200 = !DIEnumerator(name: "_ISpunct", value: 4)
!201 = !DIEnumerator(name: "_ISalnum", value: 8)
!202 = !{!45, !203, !7, !204, !206, !209, !96, !210, !211, !224, !232, !10}
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !96)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !18, line: 52, baseType: !94)
!209 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_header_t", file: !213, line: 400, baseType: !214)
!213 = !DIFile(filename: "libc/misc/locale/locale.c", directory: "/home/strahinja/build/klee-uclibc")
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !213, line: 390, size: 128, elements: !215)
!215 = !{!216, !217, !218, !219, !220, !221, !222, !223}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "num_base", scope: !214, file: !213, line: 391, baseType: !208, size: 16)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "num_der", scope: !214, file: !213, line: 392, baseType: !208, size: 16, offset: 16)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "MAX_WEIGHTS", scope: !214, file: !213, line: 393, baseType: !208, size: 16, offset: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "num_index2weight", scope: !214, file: !213, line: 394, baseType: !208, size: 16, offset: 48)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "num_weightstr", scope: !214, file: !213, line: 396, baseType: !208, size: 16, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "num_multistart", scope: !214, file: !213, line: 397, baseType: !208, size: 16, offset: 80)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "num_override", scope: !214, file: !213, line: 398, baseType: !208, size: 16, offset: 96)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "num_ruletable", scope: !214, file: !213, line: 399, baseType: !208, size: 16, offset: 112)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_der_t", file: !213, line: 430, baseType: !226)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !213, line: 425, size: 64, elements: !227)
!227 = !{!228, !229, !230, !231}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "base_idx", scope: !226, file: !213, line: 426, baseType: !208, size: 16)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !226, file: !213, line: 427, baseType: !208, size: 16, offset: 16)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "overrides_offset", scope: !226, file: !213, line: 428, baseType: !208, size: 16, offset: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_offset", scope: !226, file: !213, line: 429, baseType: !208, size: 16, offset: 48)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_base_t", file: !213, line: 423, baseType: !234)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !213, line: 402, size: 304, elements: !235)
!235 = !{!236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "num_weights", scope: !234, file: !213, line: 403, baseType: !208, size: 16)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "num_starters", scope: !234, file: !213, line: 404, baseType: !208, size: 16, offset: 16)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "ii_shift", scope: !234, file: !213, line: 405, baseType: !208, size: 16, offset: 32)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "ti_shift", scope: !234, file: !213, line: 406, baseType: !208, size: 16, offset: 48)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "ii_len", scope: !234, file: !213, line: 407, baseType: !208, size: 16, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "ti_len", scope: !234, file: !213, line: 408, baseType: !208, size: 16, offset: 80)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "max_weight", scope: !234, file: !213, line: 409, baseType: !208, size: 16, offset: 96)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "num_col_base", scope: !234, file: !213, line: 410, baseType: !208, size: 16, offset: 112)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "max_col_index", scope: !234, file: !213, line: 411, baseType: !208, size: 16, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !234, file: !213, line: 412, baseType: !208, size: 16, offset: 144)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "range_low", scope: !234, file: !213, line: 413, baseType: !208, size: 16, offset: 160)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "range_count", scope: !234, file: !213, line: 414, baseType: !208, size: 16, offset: 176)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "range_base_weight", scope: !234, file: !213, line: 415, baseType: !208, size: 16, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "range_rule_offset", scope: !234, file: !213, line: 416, baseType: !208, size: 16, offset: 208)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight_offset", scope: !234, file: !213, line: 418, baseType: !208, size: 16, offset: 224)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx_offset", scope: !234, file: !213, line: 419, baseType: !208, size: 16, offset: 240)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_offset", scope: !234, file: !213, line: 420, baseType: !208, size: 16, offset: 256)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_offset_low", scope: !234, file: !213, line: 421, baseType: !208, size: 16, offset: 272)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_offset_hi", scope: !234, file: !213, line: 422, baseType: !208, size: 16, offset: 288)
!255 = !{!256, !440, !176, !442, !445, !447}
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(name: "__global_locale", scope: !178, file: !213, line: 377, type: !258, isLocal: false, isDefinition: true)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_t", file: !182, line: 330, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__uclibc_locale_struct", file: !182, line: 154, size: 26560, elements: !261)
!261 = !{!262, !269, !275, !276, !280, !282, !283, !287, !291, !293, !294, !295, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !314, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b", scope: !260, file: !182, line: 156, baseType: !263, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !265)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ctype_mask_t", file: !266, line: 38, baseType: !267)
!266 = !DIFile(filename: "./include/bits/uClibc_touplow.h", directory: "/home/strahinja/build/klee-uclibc")
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !268, line: 44, baseType: !94)
!268 = !DIFile(filename: "./include/bits/types.h", directory: "/home/strahinja/build/klee-uclibc")
!269 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower", scope: !260, file: !182, line: 157, baseType: !270, size: 64, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ctype_touplow_t", file: !266, line: 42, baseType: !273)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !268, line: 43, baseType: !274)
!274 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper", scope: !260, file: !182, line: 158, baseType: !270, size: 64, offset: 128)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b_data", scope: !260, file: !182, line: 162, baseType: !277, size: 6144, offset: 192)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !265, size: 6144, elements: !278)
!278 = !{!279}
!279 = !DISubrange(count: 384)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower_data", scope: !260, file: !182, line: 163, baseType: !281, size: 6144, offset: 6336)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 6144, elements: !278)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper_data", scope: !260, file: !182, line: 164, baseType: !281, size: 6144, offset: 12480)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "cur_locale", scope: !260, file: !182, line: 168, baseType: !284, size: 112, offset: 18624)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 112, elements: !285)
!285 = !{!286}
!286 = !DISubrange(count: 14)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "category_offsets", scope: !260, file: !182, line: 174, baseType: !288, size: 96, offset: 18736)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 96, elements: !289)
!289 = !{!290}
!290 = !DISubrange(count: 6)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "category_item_count", scope: !260, file: !182, line: 175, baseType: !292, size: 48, offset: 18832)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 48, elements: !289)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !260, file: !182, line: 178, baseType: !96, size: 8, offset: 18880)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cur_max", scope: !260, file: !182, line: 179, baseType: !96, size: 8, offset: 18888)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit_length", scope: !260, file: !182, line: 180, baseType: !296, size: 80, offset: 18896)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 80, elements: !297)
!297 = !{!298}
!298 = !DISubrange(count: 10)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "idx8ctype", scope: !260, file: !182, line: 183, baseType: !204, size: 64, offset: 19008)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8ctype", scope: !260, file: !182, line: 184, baseType: !204, size: 64, offset: 19072)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "idx8uplow", scope: !260, file: !182, line: 185, baseType: !204, size: 64, offset: 19136)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8uplow", scope: !260, file: !182, line: 186, baseType: !204, size: 64, offset: 19200)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "idx8c2wc", scope: !260, file: !182, line: 188, baseType: !204, size: 64, offset: 19264)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8c2wc", scope: !260, file: !182, line: 189, baseType: !206, size: 64, offset: 19328)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "idx8wc2c", scope: !260, file: !182, line: 190, baseType: !204, size: 64, offset: 19392)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8wc2c", scope: !260, file: !182, line: 191, baseType: !204, size: 64, offset: 19456)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "code2flag", scope: !260, file: !182, line: 197, baseType: !206, size: 64, offset: 19520)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "tblwctype", scope: !260, file: !182, line: 199, baseType: !204, size: 64, offset: 19584)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow", scope: !260, file: !182, line: 200, baseType: !204, size: 64, offset: 19648)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow_diff", scope: !260, file: !182, line: 202, baseType: !311, size: 64, offset: 19712)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !313)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !18, line: 40, baseType: !274)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point_wc", scope: !260, file: !182, line: 205, baseType: !315, size: 32, offset: 19776)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !24, line: 90, baseType: !45)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep_wc", scope: !260, file: !182, line: 206, baseType: !315, size: 32, offset: 19808)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point_len", scope: !260, file: !182, line: 207, baseType: !45, size: 32, offset: 19840)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep_len", scope: !260, file: !182, line: 208, baseType: !45, size: 32, offset: 19872)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit0_mb", scope: !260, file: !182, line: 213, baseType: !29, size: 64, offset: 19904)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit1_mb", scope: !260, file: !182, line: 214, baseType: !29, size: 64, offset: 19968)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit2_mb", scope: !260, file: !182, line: 215, baseType: !29, size: 64, offset: 20032)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit3_mb", scope: !260, file: !182, line: 216, baseType: !29, size: 64, offset: 20096)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit4_mb", scope: !260, file: !182, line: 217, baseType: !29, size: 64, offset: 20160)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit5_mb", scope: !260, file: !182, line: 218, baseType: !29, size: 64, offset: 20224)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit6_mb", scope: !260, file: !182, line: 219, baseType: !29, size: 64, offset: 20288)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit7_mb", scope: !260, file: !182, line: 220, baseType: !29, size: 64, offset: 20352)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit8_mb", scope: !260, file: !182, line: 221, baseType: !29, size: 64, offset: 20416)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit9_mb", scope: !260, file: !182, line: 222, baseType: !29, size: 64, offset: 20480)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "codeset", scope: !260, file: !182, line: 223, baseType: !29, size: 64, offset: 20544)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !260, file: !182, line: 226, baseType: !29, size: 64, offset: 20608)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !260, file: !182, line: 227, baseType: !29, size: 64, offset: 20672)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !260, file: !182, line: 228, baseType: !29, size: 64, offset: 20736)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !260, file: !182, line: 231, baseType: !29, size: 64, offset: 20800)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !260, file: !182, line: 232, baseType: !29, size: 64, offset: 20864)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !260, file: !182, line: 233, baseType: !29, size: 64, offset: 20928)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !260, file: !182, line: 234, baseType: !29, size: 64, offset: 20992)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !260, file: !182, line: 235, baseType: !29, size: 64, offset: 21056)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !260, file: !182, line: 236, baseType: !29, size: 64, offset: 21120)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !260, file: !182, line: 237, baseType: !29, size: 64, offset: 21184)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !260, file: !182, line: 238, baseType: !29, size: 64, offset: 21248)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !260, file: !182, line: 239, baseType: !29, size: 64, offset: 21312)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !260, file: !182, line: 240, baseType: !29, size: 64, offset: 21376)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !260, file: !182, line: 241, baseType: !29, size: 64, offset: 21440)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !260, file: !182, line: 242, baseType: !29, size: 64, offset: 21504)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !260, file: !182, line: 243, baseType: !29, size: 64, offset: 21568)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !260, file: !182, line: 244, baseType: !29, size: 64, offset: 21632)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !260, file: !182, line: 245, baseType: !29, size: 64, offset: 21696)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !260, file: !182, line: 246, baseType: !29, size: 64, offset: 21760)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !260, file: !182, line: 247, baseType: !29, size: 64, offset: 21824)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !260, file: !182, line: 248, baseType: !29, size: 64, offset: 21888)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !260, file: !182, line: 249, baseType: !29, size: 64, offset: 21952)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !260, file: !182, line: 250, baseType: !29, size: 64, offset: 22016)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !260, file: !182, line: 251, baseType: !29, size: 64, offset: 22080)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "crncystr", scope: !260, file: !182, line: 253, baseType: !29, size: 64, offset: 22144)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "abday_1", scope: !260, file: !182, line: 256, baseType: !29, size: 64, offset: 22208)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "abday_2", scope: !260, file: !182, line: 257, baseType: !29, size: 64, offset: 22272)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "abday_3", scope: !260, file: !182, line: 258, baseType: !29, size: 64, offset: 22336)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "abday_4", scope: !260, file: !182, line: 259, baseType: !29, size: 64, offset: 22400)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "abday_5", scope: !260, file: !182, line: 260, baseType: !29, size: 64, offset: 22464)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "abday_6", scope: !260, file: !182, line: 261, baseType: !29, size: 64, offset: 22528)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "abday_7", scope: !260, file: !182, line: 262, baseType: !29, size: 64, offset: 22592)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "day_1", scope: !260, file: !182, line: 264, baseType: !29, size: 64, offset: 22656)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "day_2", scope: !260, file: !182, line: 265, baseType: !29, size: 64, offset: 22720)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "day_3", scope: !260, file: !182, line: 266, baseType: !29, size: 64, offset: 22784)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "day_4", scope: !260, file: !182, line: 267, baseType: !29, size: 64, offset: 22848)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "day_5", scope: !260, file: !182, line: 268, baseType: !29, size: 64, offset: 22912)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "day_6", scope: !260, file: !182, line: 269, baseType: !29, size: 64, offset: 22976)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "day_7", scope: !260, file: !182, line: 270, baseType: !29, size: 64, offset: 23040)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_1", scope: !260, file: !182, line: 272, baseType: !29, size: 64, offset: 23104)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_2", scope: !260, file: !182, line: 273, baseType: !29, size: 64, offset: 23168)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_3", scope: !260, file: !182, line: 274, baseType: !29, size: 64, offset: 23232)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_4", scope: !260, file: !182, line: 275, baseType: !29, size: 64, offset: 23296)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_5", scope: !260, file: !182, line: 276, baseType: !29, size: 64, offset: 23360)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_6", scope: !260, file: !182, line: 277, baseType: !29, size: 64, offset: 23424)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_7", scope: !260, file: !182, line: 278, baseType: !29, size: 64, offset: 23488)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_8", scope: !260, file: !182, line: 279, baseType: !29, size: 64, offset: 23552)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_9", scope: !260, file: !182, line: 280, baseType: !29, size: 64, offset: 23616)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_10", scope: !260, file: !182, line: 281, baseType: !29, size: 64, offset: 23680)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_11", scope: !260, file: !182, line: 282, baseType: !29, size: 64, offset: 23744)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_12", scope: !260, file: !182, line: 283, baseType: !29, size: 64, offset: 23808)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "mon_1", scope: !260, file: !182, line: 285, baseType: !29, size: 64, offset: 23872)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "mon_2", scope: !260, file: !182, line: 286, baseType: !29, size: 64, offset: 23936)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "mon_3", scope: !260, file: !182, line: 287, baseType: !29, size: 64, offset: 24000)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "mon_4", scope: !260, file: !182, line: 288, baseType: !29, size: 64, offset: 24064)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "mon_5", scope: !260, file: !182, line: 289, baseType: !29, size: 64, offset: 24128)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "mon_6", scope: !260, file: !182, line: 290, baseType: !29, size: 64, offset: 24192)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "mon_7", scope: !260, file: !182, line: 291, baseType: !29, size: 64, offset: 24256)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "mon_8", scope: !260, file: !182, line: 292, baseType: !29, size: 64, offset: 24320)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "mon_9", scope: !260, file: !182, line: 293, baseType: !29, size: 64, offset: 24384)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "mon_10", scope: !260, file: !182, line: 294, baseType: !29, size: 64, offset: 24448)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "mon_11", scope: !260, file: !182, line: 295, baseType: !29, size: 64, offset: 24512)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "mon_12", scope: !260, file: !182, line: 296, baseType: !29, size: 64, offset: 24576)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "am_str", scope: !260, file: !182, line: 298, baseType: !29, size: 64, offset: 24640)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "pm_str", scope: !260, file: !182, line: 299, baseType: !29, size: 64, offset: 24704)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "d_t_fmt", scope: !260, file: !182, line: 301, baseType: !29, size: 64, offset: 24768)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "d_fmt", scope: !260, file: !182, line: 302, baseType: !29, size: 64, offset: 24832)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "t_fmt", scope: !260, file: !182, line: 303, baseType: !29, size: 64, offset: 24896)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "t_fmt_ampm", scope: !260, file: !182, line: 304, baseType: !29, size: 64, offset: 24960)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "era", scope: !260, file: !182, line: 305, baseType: !29, size: 64, offset: 25024)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "era_year", scope: !260, file: !182, line: 307, baseType: !29, size: 64, offset: 25088)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "era_d_fmt", scope: !260, file: !182, line: 308, baseType: !29, size: 64, offset: 25152)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "alt_digits", scope: !260, file: !182, line: 309, baseType: !29, size: 64, offset: 25216)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "era_d_t_fmt", scope: !260, file: !182, line: 310, baseType: !29, size: 64, offset: 25280)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "era_t_fmt", scope: !260, file: !182, line: 311, baseType: !29, size: 64, offset: 25344)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "yesexpr", scope: !260, file: !182, line: 316, baseType: !29, size: 64, offset: 25408)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "noexpr", scope: !260, file: !182, line: 317, baseType: !29, size: 64, offset: 25472)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "yesstr", scope: !260, file: !182, line: 318, baseType: !29, size: 64, offset: 25536)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "nostr", scope: !260, file: !182, line: 319, baseType: !29, size: 64, offset: 25600)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "collate", scope: !260, file: !182, line: 322, baseType: !410, size: 896, offset: 25664)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "__collate_t", file: !182, line: 149, baseType: !411)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !182, line: 111, size: 896, elements: !412)
!412 = !{!413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !438, !439}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "num_weights", scope: !411, file: !182, line: 112, baseType: !208, size: 16)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "num_starters", scope: !411, file: !182, line: 113, baseType: !208, size: 16, offset: 16)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ii_shift", scope: !411, file: !182, line: 114, baseType: !208, size: 16, offset: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "ti_shift", scope: !411, file: !182, line: 115, baseType: !208, size: 16, offset: 48)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "ii_len", scope: !411, file: !182, line: 116, baseType: !208, size: 16, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "ti_len", scope: !411, file: !182, line: 117, baseType: !208, size: 16, offset: 80)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "max_weight", scope: !411, file: !182, line: 118, baseType: !208, size: 16, offset: 96)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "num_col_base", scope: !411, file: !182, line: 119, baseType: !208, size: 16, offset: 112)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "max_col_index", scope: !411, file: !182, line: 120, baseType: !208, size: 16, offset: 128)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !411, file: !182, line: 121, baseType: !208, size: 16, offset: 144)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "range_low", scope: !411, file: !182, line: 122, baseType: !208, size: 16, offset: 160)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "range_count", scope: !411, file: !182, line: 123, baseType: !208, size: 16, offset: 176)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "range_base_weight", scope: !411, file: !182, line: 124, baseType: !208, size: 16, offset: 192)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "range_rule_offset", scope: !411, file: !182, line: 125, baseType: !208, size: 16, offset: 208)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "ii_mask", scope: !411, file: !182, line: 127, baseType: !208, size: 16, offset: 224)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "ti_mask", scope: !411, file: !182, line: 128, baseType: !208, size: 16, offset: 240)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight_tbl", scope: !411, file: !182, line: 130, baseType: !206, size: 64, offset: 256)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx_tbl", scope: !411, file: !182, line: 131, baseType: !206, size: 64, offset: 320)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_tbl", scope: !411, file: !182, line: 132, baseType: !206, size: 64, offset: 384)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_tbl", scope: !411, file: !182, line: 135, baseType: !206, size: 64, offset: 448)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "overrides_tbl", scope: !411, file: !182, line: 138, baseType: !206, size: 64, offset: 512)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "weightstr", scope: !411, file: !182, line: 141, baseType: !206, size: 64, offset: 576)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "ruletable", scope: !411, file: !182, line: 142, baseType: !206, size: 64, offset: 640)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight", scope: !411, file: !182, line: 145, baseType: !437, size: 64, offset: 704)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx", scope: !411, file: !182, line: 146, baseType: !437, size: 64, offset: 768)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "MAX_WEIGHTS", scope: !411, file: !182, line: 148, baseType: !208, size: 16, offset: 832)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(name: "__curlocale_var", scope: !178, file: !213, line: 380, type: !258, isLocal: false, isDefinition: true)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(name: "utf8", scope: !178, file: !213, line: 387, type: !444, isLocal: true, isDefinition: true)
!444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 48, elements: !289)
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(name: "ascii", scope: !178, file: !213, line: 388, type: !444, isLocal: true, isDefinition: true)
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(name: "__code2flag", scope: !178, file: !213, line: 854, type: !449, isLocal: true, isDefinition: true)
!449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 256, elements: !450)
!450 = !{!451}
!451 = !DISubrange(count: 16)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uclibc_locale_t", file: !182, line: 324, baseType: !260)
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(name: "_stdio_streams", scope: !455, file: !456, line: 131, type: !500, isLocal: true, isDefinition: true)
!455 = distinct !DICompileUnit(language: DW_LANG_C99, file: !456, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !457)
!456 = !DIFile(filename: "libc/stdio/_stdio.c", directory: "/home/strahinja/build/klee-uclibc")
!457 = !{!458, !490, !492, !494, !496, !498, !453}
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(name: "stdin", scope: !455, file: !456, line: 154, type: !460, isLocal: false, isDefinition: true)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !462, line: 46, baseType: !463)
!462 = !DIFile(filename: "./include/stdio.h", directory: "/home/strahinja/build/klee-uclibc")
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__STDIO_FILE_STRUCT", file: !464, line: 233, size: 704, elements: !465)
!464 = !DIFile(filename: "./include/bits/uClibc_stdio.h", directory: "/home/strahinja/build/klee-uclibc")
!465 = !{!466, !467, !471, !472, !473, !474, !475, !476, !477, !478, !480, !482, !489}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "__modeflags", scope: !463, file: !464, line: 234, baseType: !94, size: 16)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "__ungot_width", scope: !463, file: !464, line: 237, baseType: !468, size: 16, offset: 16)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 16, elements: !469)
!469 = !{!470}
!470 = !DISubrange(count: 2)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "__filedes", scope: !463, file: !464, line: 244, baseType: !45, size: 32, offset: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "__bufstart", scope: !463, file: !464, line: 246, baseType: !210, size: 64, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "__bufend", scope: !463, file: !464, line: 247, baseType: !210, size: 64, offset: 128)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "__bufpos", scope: !463, file: !464, line: 248, baseType: !210, size: 64, offset: 192)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "__bufread", scope: !463, file: !464, line: 249, baseType: !210, size: 64, offset: 256)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "__bufgetc_u", scope: !463, file: !464, line: 252, baseType: !210, size: 64, offset: 320)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "__bufputc_u", scope: !463, file: !464, line: 255, baseType: !210, size: 64, offset: 384)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "__nextopen", scope: !463, file: !464, line: 261, baseType: !479, size: 64, offset: 448)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "__ungot", scope: !463, file: !464, line: 268, baseType: !481, size: 64, offset: 512)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !315, size: 64, elements: !469)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "__state", scope: !463, file: !464, line: 271, baseType: !483, size: 64, offset: 576)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !484, line: 85, baseType: !485)
!484 = !DIFile(filename: "./include/wchar.h", directory: "/home/strahinja/build/klee-uclibc")
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !484, line: 81, size: 64, elements: !486)
!486 = !{!487, !488}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "__mask", scope: !485, file: !484, line: 83, baseType: !315, size: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "__wc", scope: !485, file: !484, line: 84, baseType: !315, size: 32, offset: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !463, file: !464, line: 274, baseType: !6, size: 64, offset: 640)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(name: "stdout", scope: !455, file: !456, line: 155, type: !460, isLocal: false, isDefinition: true)
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(name: "stderr", scope: !455, file: !456, line: 156, type: !460, isLocal: false, isDefinition: true)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(name: "__stdin", scope: !455, file: !456, line: 159, type: !460, isLocal: false, isDefinition: true)
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(name: "__stdout", scope: !455, file: !456, line: 162, type: !460, isLocal: false, isDefinition: true)
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(name: "_stdio_openlist", scope: !455, file: !456, line: 180, type: !460, isLocal: false, isDefinition: true)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !461, size: 2112, elements: !138)
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(name: "__exit_cleanup", scope: !503, file: !506, line: 309, type: !507, isLocal: false, isDefinition: true)
!503 = distinct !DICompileUnit(language: DW_LANG_C99, file: !504, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !505)
!504 = !DIFile(filename: "libc/stdlib/exit.c", directory: "/home/strahinja/build/klee-uclibc")
!505 = !{!501}
!506 = !DIFile(filename: "libc/stdlib/_atexit.c", directory: "/home/strahinja/build/klee-uclibc")
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DISubroutineType(types: !509)
!509 = !{null, !45}
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(name: "program_name", scope: !512, file: !513, line: 66, type: !7, isLocal: false, isDefinition: true)
!512 = distinct !DICompileUnit(language: DW_LANG_C99, file: !513, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !514, retainedTypes: !534, globals: !543)
!513 = !DIFile(filename: "../../src/head.c", directory: "/home/strahinja/coreutils-6.11/obj-llvm/src")
!514 = !{!515, !520, !528}
!515 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "header_mode", file: !513, line: 60, size: 32, elements: !516)
!516 = !{!517, !518, !519}
!517 = !DIEnumerator(name: "multiple_files", value: 0)
!518 = !DIEnumerator(name: "always", value: 1)
!519 = !DIEnumerator(name: "never", value: 2)
!520 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !521, line: 26, size: 32, elements: !522)
!521 = !DIFile(filename: "../../lib/xstrtol.h", directory: "/home/strahinja/coreutils-6.11/obj-llvm/src")
!522 = !{!523, !524, !525, !526, !527}
!523 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!524 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!525 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!526 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!527 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!528 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Copy_fd_status", file: !513, line: 71, size: 32, elements: !529)
!529 = !{!530, !531, !532, !533}
!530 = !DIEnumerator(name: "COPY_FD_OK", value: 0)
!531 = !DIEnumerator(name: "COPY_FD_READ_ERROR", value: 1)
!532 = !DIEnumerator(name: "COPY_FD_WRITE_ERROR", value: 2)
!533 = !DIEnumerator(name: "COPY_FD_UNEXPECTED_EOF", value: 3)
!534 = !{!29, !113, !7, !6, !535, !539, !541}
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !536, line: 57, baseType: !537)
!536 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/strahinja/coreutils-6.11/obj-llvm/src")
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !538, line: 140, baseType: !81)
!538 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/strahinja/coreutils-6.11/obj-llvm/src")
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !542, line: 62, baseType: !10)
!542 = !DIFile(filename: "/usr/lib/llvm-6.0/lib/clang/6.0.0/include/stddef.h", directory: "/home/strahinja/coreutils-6.11/obj-llvm/src")
!543 = !{!544, !577, !579, !510, !581, !583, !597}
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(name: "default_file_list", scope: !546, file: !513, line: 917, type: !576, isLocal: true, isDefinition: true)
!546 = distinct !DISubprogram(name: "main", scope: !513, file: !513, line: 897, type: !547, isLocal: false, isDefinition: true, scopeLine: 898, flags: DIFlagPrototyped, isOptimized: true, unit: !512, variables: !549)
!547 = !DISubroutineType(types: !548)
!548 = !{!45, !45, !37}
!549 = !{!550, !551, !552, !553, !555, !556, !557, !561, !562, !563, !564, !567, !568, !569, !570}
!550 = !DILocalVariable(name: "argc", arg: 1, scope: !546, file: !513, line: 897, type: !45)
!551 = !DILocalVariable(name: "argv", arg: 2, scope: !546, file: !513, line: 897, type: !37)
!552 = !DILocalVariable(name: "header_mode", scope: !546, file: !513, line: 899, type: !515)
!553 = !DILocalVariable(name: "ok", scope: !546, file: !513, line: 900, type: !554)
!554 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!555 = !DILocalVariable(name: "c", scope: !546, file: !513, line: 901, type: !45)
!556 = !DILocalVariable(name: "i", scope: !546, file: !513, line: 902, type: !541)
!557 = !DILocalVariable(name: "n_units", scope: !546, file: !513, line: 905, type: !558)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !559, line: 112, baseType: !560)
!559 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/strahinja/coreutils-6.11/obj-llvm/src")
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !538, line: 62, baseType: !10)
!561 = !DILocalVariable(name: "count_lines", scope: !546, file: !513, line: 909, type: !554)
!562 = !DILocalVariable(name: "elide_from_end", scope: !546, file: !513, line: 913, type: !554)
!563 = !DILocalVariable(name: "file_list", scope: !546, file: !513, line: 918, type: !539)
!564 = !DILocalVariable(name: "a", scope: !565, file: !513, line: 934, type: !7)
!565 = distinct !DILexicalBlock(scope: !566, file: !513, line: 933, column: 5)
!566 = distinct !DILexicalBlock(scope: !546, file: !513, line: 932, column: 7)
!567 = !DILocalVariable(name: "n_string", scope: !565, file: !513, line: 935, type: !7)
!568 = !DILocalVariable(name: "end_n_string", scope: !565, file: !513, line: 936, type: !7)
!569 = !DILocalVariable(name: "multiplier_char", scope: !565, file: !513, line: 937, type: !8)
!570 = !DILocalVariable(name: "umax_buf", scope: !571, file: !513, line: 1046, type: !573)
!571 = distinct !DILexicalBlock(scope: !572, file: !513, line: 1045, column: 5)
!572 = distinct !DILexicalBlock(scope: !546, file: !513, line: 1044, column: 8)
!573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 168, elements: !574)
!574 = !{!575}
!575 = !DISubrange(count: 21)
!576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !540, size: 128, elements: !469)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(name: "presume_input_pipe", scope: !512, file: !513, line: 54, type: !554, isLocal: true, isDefinition: true)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(name: "print_headers", scope: !512, file: !513, line: 57, type: !554, isLocal: true, isDefinition: true)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !512, file: !513, line: 69, type: !554, isLocal: true, isDefinition: true)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(name: "long_options", scope: !512, file: !513, line: 86, type: !585, isLocal: true, isDefinition: true)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !586, size: 2304, elements: !595)
!586 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !587)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !588, line: 50, size: 256, elements: !589)
!588 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "/home/strahinja/coreutils-6.11/obj-llvm/src")
!589 = !{!590, !591, !592, !594}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !587, file: !588, line: 52, baseType: !29, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !587, file: !588, line: 55, baseType: !45, size: 32, offset: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !587, file: !588, line: 56, baseType: !593, size: 64, offset: 128)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !587, file: !588, line: 57, baseType: !45, size: 32, offset: 192)
!595 = !{!596}
!596 = !DISubrange(count: 9)
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(name: "first_file", scope: !599, file: !513, line: 168, type: !554, isLocal: true, isDefinition: true)
!599 = distinct !DISubprogram(name: "write_header", scope: !513, file: !513, line: 166, type: !600, isLocal: true, isDefinition: true, scopeLine: 167, flags: DIFlagPrototyped, isOptimized: true, unit: !512, variables: !602)
!600 = !DISubroutineType(types: !601)
!601 = !{null, !29}
!602 = !{!603}
!603 = !DILocalVariable(name: "filename", arg: 1, scope: !599, file: !513, line: 166, type: !29)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !606, file: !607, line: 26, type: !609, isLocal: false, isDefinition: true)
!606 = distinct !DICompileUnit(language: DW_LANG_C99, file: !607, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !608)
!607 = !DIFile(filename: "../../lib/version-etc-fsf.c", directory: "/home/strahinja/coreutils-6.11/obj-llvm/lib")
!608 = !{!604}
!609 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 376, elements: !610)
!610 = !{!611}
!611 = !DISubrange(count: 47)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(name: "exit_failure", scope: !614, file: !615, line: 24, type: !617, isLocal: false, isDefinition: true)
!614 = distinct !DICompileUnit(language: DW_LANG_C99, file: !615, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !616)
!615 = !DIFile(filename: "../../lib/exitfail.c", directory: "/home/strahinja/coreutils-6.11/obj-llvm/lib")
!616 = !{!612}
!617 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !45)
!618 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!619 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!620 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!621 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(name: "slot0", scope: !624, file: !625, line: 650, type: !98, isLocal: true, isDefinition: true)
!624 = distinct !DICompileUnit(language: DW_LANG_C99, file: !625, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !626, retainedTypes: !645, globals: !648)
!625 = !DIFile(filename: "../../lib/quotearg.c", directory: "/home/strahinja/coreutils-6.11/obj-llvm/lib")
!626 = !{!627, !638, !643}
!627 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !628, line: 32, size: 32, elements: !629)
!628 = !DIFile(filename: "../../lib/quotearg.h", directory: "/home/strahinja/coreutils-6.11/obj-llvm/lib")
!629 = !{!630, !631, !632, !633, !634, !635, !636, !637}
!630 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!631 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!632 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!633 = !DIEnumerator(name: "c_quoting_style", value: 3)
!634 = !DIEnumerator(name: "c_maybe_quoting_style", value: 4)
!635 = !DIEnumerator(name: "escape_quoting_style", value: 5)
!636 = !DIEnumerator(name: "locale_quoting_style", value: 6)
!637 = !DIEnumerator(name: "clocale_quoting_style", value: 7)
!638 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !628, line: 164, size: 32, elements: !639)
!639 = !{!640, !641, !642}
!640 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!641 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!642 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!643 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !644, line: 46, size: 32, elements: !189)
!644 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/strahinja/coreutils-6.11/obj-llvm/lib")
!645 = !{!646, !45, !94, !29, !7}
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !647, line: 62, baseType: !10)
!647 = !DIFile(filename: "/usr/lib/llvm-6.0/lib/clang/6.0.0/include/stddef.h", directory: "/home/strahinja/coreutils-6.11/obj-llvm/lib")
!648 = !{!649, !652, !658, !622, !666, !673, !675}
!649 = !DIGlobalVariableExpression(var: !650, expr: !DIExpression())
!650 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !624, file: !625, line: 77, type: !651, isLocal: false, isDefinition: true)
!651 = !DICompositeType(tag: DW_TAG_array_type, baseType: !540, size: 576, elements: !595)
!652 = !DIGlobalVariableExpression(var: !653, expr: !DIExpression())
!653 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !624, file: !625, line: 91, type: !654, isLocal: false, isDefinition: true)
!654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !655, size: 256, elements: !656)
!655 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !627)
!656 = !{!657}
!657 = !DISubrange(count: 8)
!658 = !DIGlobalVariableExpression(var: !659, expr: !DIExpression())
!659 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !624, file: !625, line: 104, type: !660, isLocal: true, isDefinition: true)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !625, line: 63, size: 320, elements: !661)
!661 = !{!662, !663, !664}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !660, file: !625, line: 66, baseType: !627, size: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !660, file: !625, line: 69, baseType: !45, size: 32, offset: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !660, file: !625, line: 73, baseType: !665, size: 256, offset: 64)
!665 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 256, elements: !656)
!666 = !DIGlobalVariableExpression(var: !667, expr: !DIExpression())
!667 = distinct !DIGlobalVariable(name: "slotvec", scope: !624, file: !625, line: 653, type: !668, isLocal: true, isDefinition: true)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !625, line: 642, size: 128, elements: !670)
!670 = !{!671, !672}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !669, file: !625, line: 644, baseType: !646, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !669, file: !625, line: 645, baseType: !7, size: 64, offset: 64)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(name: "nslots", scope: !624, file: !625, line: 651, type: !113, isLocal: true, isDefinition: true)
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(name: "slotvec0", scope: !624, file: !625, line: 652, type: !669, isLocal: true, isDefinition: true)
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(name: "wide_null_string", scope: !679, file: !680, line: 112, type: !776, isLocal: true, isDefinition: true)
!679 = distinct !DISubprogram(name: "printf_fetchargs", scope: !680, file: !680, line: 36, type: !681, isLocal: false, isDefinition: true, scopeLine: 37, flags: DIFlagPrototyped, isOptimized: true, unit: !767, variables: !771)
!680 = !DIFile(filename: "../../lib/printf-args.c", directory: "/home/strahinja/coreutils-6.11/obj-llvm/lib")
!681 = !DISubroutineType(types: !682)
!682 = !{!45, !683, !690}
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !680, size: 192, elements: !685)
!685 = !{!686, !687, !688, !689}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !684, file: !680, baseType: !113, size: 32)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !684, file: !680, baseType: !113, size: 32, offset: 32)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !684, file: !680, baseType: !6, size: 64, offset: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !684, file: !680, baseType: !6, size: 64, offset: 128)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "arguments", file: !692, line: 143, baseType: !693)
!692 = !DIFile(filename: "../../lib/printf-args.h", directory: "/home/strahinja/coreutils-6.11/obj-llvm/lib")
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !692, line: 138, size: 128, elements: !694)
!694 = !{!695, !696}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !693, file: !692, line: 140, baseType: !646, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !693, file: !692, line: 141, baseType: !697, size: 64, offset: 64)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "argument", file: !692, line: 136, baseType: !699)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !692, line: 91, size: 256, elements: !700)
!700 = !{!701, !728}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !699, file: !692, line: 93, baseType: !702, size: 32)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "arg_type", file: !692, line: 88, baseType: !703)
!703 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !692, line: 49, size: 32, elements: !704)
!704 = !{!705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727}
!705 = !DIEnumerator(name: "TYPE_NONE", value: 0)
!706 = !DIEnumerator(name: "TYPE_SCHAR", value: 1)
!707 = !DIEnumerator(name: "TYPE_UCHAR", value: 2)
!708 = !DIEnumerator(name: "TYPE_SHORT", value: 3)
!709 = !DIEnumerator(name: "TYPE_USHORT", value: 4)
!710 = !DIEnumerator(name: "TYPE_INT", value: 5)
!711 = !DIEnumerator(name: "TYPE_UINT", value: 6)
!712 = !DIEnumerator(name: "TYPE_LONGINT", value: 7)
!713 = !DIEnumerator(name: "TYPE_ULONGINT", value: 8)
!714 = !DIEnumerator(name: "TYPE_LONGLONGINT", value: 9)
!715 = !DIEnumerator(name: "TYPE_ULONGLONGINT", value: 10)
!716 = !DIEnumerator(name: "TYPE_DOUBLE", value: 11)
!717 = !DIEnumerator(name: "TYPE_LONGDOUBLE", value: 12)
!718 = !DIEnumerator(name: "TYPE_CHAR", value: 13)
!719 = !DIEnumerator(name: "TYPE_WIDE_CHAR", value: 14)
!720 = !DIEnumerator(name: "TYPE_STRING", value: 15)
!721 = !DIEnumerator(name: "TYPE_WIDE_STRING", value: 16)
!722 = !DIEnumerator(name: "TYPE_POINTER", value: 17)
!723 = !DIEnumerator(name: "TYPE_COUNT_SCHAR_POINTER", value: 18)
!724 = !DIEnumerator(name: "TYPE_COUNT_SHORT_POINTER", value: 19)
!725 = !DIEnumerator(name: "TYPE_COUNT_INT_POINTER", value: 20)
!726 = !DIEnumerator(name: "TYPE_COUNT_LONGINT_POINTER", value: 21)
!727 = !DIEnumerator(name: "TYPE_COUNT_LONGLONGINT_POINTER", value: 22)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !699, file: !692, line: 134, baseType: !729, size: 128, offset: 128)
!729 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !699, file: !692, line: 94, size: 128, elements: !730)
!730 = !{!731, !732, !733, !734, !735, !736, !737, !738, !739, !741, !742, !744, !746, !748, !749, !752, !753, !757, !758, !760, !762, !763, !765}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "a_schar", scope: !729, file: !692, line: 96, baseType: !209, size: 8)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "a_uchar", scope: !729, file: !692, line: 97, baseType: !96, size: 8)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "a_short", scope: !729, file: !692, line: 98, baseType: !274, size: 16)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "a_ushort", scope: !729, file: !692, line: 99, baseType: !94, size: 16)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "a_int", scope: !729, file: !692, line: 100, baseType: !45, size: 32)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint", scope: !729, file: !692, line: 101, baseType: !113, size: 32)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "a_longint", scope: !729, file: !692, line: 102, baseType: !81, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulongint", scope: !729, file: !692, line: 103, baseType: !10, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "a_longlongint", scope: !729, file: !692, line: 105, baseType: !740, size: 64)
!740 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulonglongint", scope: !729, file: !692, line: 106, baseType: !25, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "a_float", scope: !729, file: !692, line: 108, baseType: !743, size: 32)
!743 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "a_double", scope: !729, file: !692, line: 109, baseType: !745, size: 64)
!745 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "a_longdouble", scope: !729, file: !692, line: 110, baseType: !747, size: 128)
!747 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "a_char", scope: !729, file: !692, line: 111, baseType: !45, size: 32)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_char", scope: !729, file: !692, line: 113, baseType: !750, size: 32)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !751, line: 20, baseType: !113)
!751 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/wint_t.h", directory: "/home/strahinja/coreutils-6.11/obj-llvm/lib")
!752 = !DIDerivedType(tag: DW_TAG_member, name: "a_string", scope: !729, file: !692, line: 115, baseType: !29, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_string", scope: !729, file: !692, line: 117, baseType: !754, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !756)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !647, line: 90, baseType: !45)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "a_pointer", scope: !729, file: !692, line: 119, baseType: !6, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_schar_pointer", scope: !729, file: !692, line: 120, baseType: !759, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_short_pointer", scope: !729, file: !692, line: 121, baseType: !761, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_pointer", scope: !729, file: !692, line: 122, baseType: !593, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longint_pointer", scope: !729, file: !692, line: 123, baseType: !764, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longlongint_pointer", scope: !729, file: !692, line: 125, baseType: !766, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!767 = distinct !DICompileUnit(language: DW_LANG_C99, file: !680, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !768, retainedTypes: !769, globals: !770)
!768 = !{!703}
!769 = !{!6}
!770 = !{!677}
!771 = !{!772, !773, !774, !775}
!772 = !DILocalVariable(name: "args", arg: 1, scope: !679, file: !680, line: 36, type: !683)
!773 = !DILocalVariable(name: "a", arg: 2, scope: !679, file: !680, line: 36, type: !690)
!774 = !DILocalVariable(name: "i", scope: !679, file: !680, line: 38, type: !646)
!775 = !DILocalVariable(name: "ap", scope: !679, file: !680, line: 39, type: !697)
!776 = !DICompositeType(tag: DW_TAG_array_type, baseType: !755, size: 224, elements: !777)
!777 = !{!778}
!778 = !DISubrange(count: 7)
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(name: "__exe_env", scope: !781, file: !782, line: 37, type: !832, isLocal: false, isDefinition: true)
!781 = distinct !DICompileUnit(language: DW_LANG_C89, file: !782, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !783)
!782 = !DIFile(filename: "/home/strahinja/repo/klee/runtime/POSIX/fd_init.c", directory: "/home/strahinja/repo/runtime/POSIX")
!783 = !{!779, !784}
!784 = !DIGlobalVariableExpression(var: !785, expr: !DIExpression())
!785 = distinct !DIGlobalVariable(name: "__exe_fs", scope: !781, file: !782, line: 24, type: !786, isLocal: false, isDefinition: true)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "exe_file_system_t", file: !62, line: 74, baseType: !787)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !62, line: 62, size: 832, elements: !788)
!788 = !{!789, !790, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "n_sym_files", scope: !787, file: !62, line: 63, baseType: !113, size: 32)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "sym_stdin", scope: !787, file: !62, line: 64, baseType: !791, size: 64, offset: 64)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "exe_disk_file_t", file: !62, line: 44, baseType: !793)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !62, line: 40, size: 192, elements: !794)
!794 = !{!795, !796, !797}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !793, file: !62, line: 41, baseType: !113, size: 32)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !793, file: !62, line: 42, baseType: !7, size: 64, offset: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "stat", scope: !793, file: !62, line: 43, baseType: !798, size: 64, offset: 128)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !103, line: 119, size: 1152, elements: !800)
!800 = !{!801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !813, !818, !819, !820}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !799, file: !103, line: 121, baseType: !106, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !799, file: !103, line: 123, baseType: !91, size: 64, offset: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !799, file: !103, line: 124, baseType: !110, size: 64, offset: 128)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !799, file: !103, line: 125, baseType: !112, size: 32, offset: 192)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !799, file: !103, line: 132, baseType: !115, size: 32, offset: 224)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !799, file: !103, line: 133, baseType: !117, size: 32, offset: 256)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !799, file: !103, line: 135, baseType: !45, size: 32, offset: 288)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !799, file: !103, line: 136, baseType: !106, size: 64, offset: 320)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !799, file: !103, line: 137, baseType: !121, size: 64, offset: 384)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !799, file: !103, line: 143, baseType: !123, size: 64, offset: 448)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !799, file: !103, line: 144, baseType: !812, size: 64, offset: 512)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !85, line: 168, baseType: !81)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !799, file: !103, line: 152, baseType: !814, size: 128, offset: 576)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !128, line: 8, size: 128, elements: !815)
!815 = !{!816, !817}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !814, file: !128, line: 10, baseType: !131, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !814, file: !128, line: 11, baseType: !133, size: 64, offset: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !799, file: !103, line: 153, baseType: !814, size: 128, offset: 704)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !799, file: !103, line: 154, baseType: !814, size: 128, offset: 832)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !799, file: !103, line: 164, baseType: !137, size: 192, offset: 960)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "sym_stdout", scope: !787, file: !62, line: 64, baseType: !791, size: 64, offset: 128)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "stdout_writes", scope: !787, file: !62, line: 65, baseType: !113, size: 32, offset: 192)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "sym_files", scope: !787, file: !62, line: 66, baseType: !791, size: 64, offset: 256)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "max_failures", scope: !787, file: !62, line: 69, baseType: !113, size: 32, offset: 320)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "read_fail", scope: !787, file: !62, line: 72, baseType: !593, size: 64, offset: 384)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "write_fail", scope: !787, file: !62, line: 72, baseType: !593, size: 64, offset: 448)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "close_fail", scope: !787, file: !62, line: 72, baseType: !593, size: 64, offset: 512)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "ftruncate_fail", scope: !787, file: !62, line: 72, baseType: !593, size: 64, offset: 576)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "getcwd_fail", scope: !787, file: !62, line: 72, baseType: !593, size: 64, offset: 640)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "chmod_fail", scope: !787, file: !62, line: 73, baseType: !593, size: 64, offset: 704)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "fchmod_fail", scope: !787, file: !62, line: 73, baseType: !593, size: 64, offset: 768)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "exe_sym_env_t", file: !62, line: 89, baseType: !833)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !62, line: 81, size: 6272, elements: !834)
!834 = !{!835, !846, !847, !848}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "fds", scope: !833, file: !62, line: 82, baseType: !836, size: 6144)
!836 = !DICompositeType(tag: DW_TAG_array_type, baseType: !837, size: 6144, elements: !844)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "exe_file_t", file: !62, line: 60, baseType: !838)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !62, line: 53, size: 192, elements: !839)
!839 = !{!840, !841, !842, !843}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !838, file: !62, line: 54, baseType: !45, size: 32)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !838, file: !62, line: 55, baseType: !113, size: 32, offset: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !838, file: !62, line: 58, baseType: !82, size: 64, offset: 64)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "dfile", scope: !838, file: !62, line: 59, baseType: !791, size: 64, offset: 128)
!844 = !{!845}
!845 = !DISubrange(count: 32)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "umask", scope: !833, file: !62, line: 83, baseType: !165, size: 32, offset: 6144)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !833, file: !62, line: 84, baseType: !113, size: 32, offset: 6176)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "save_all_writes", scope: !833, file: !62, line: 88, baseType: !45, size: 32, offset: 6208)
!849 = !DIGlobalVariableExpression(var: !850, expr: !DIExpression())
!850 = distinct !DIGlobalVariable(name: "locale_mmap", scope: !851, file: !856, line: 11, type: !858, isLocal: true, isDefinition: true)
!851 = distinct !DICompileUnit(language: DW_LANG_C99, file: !852, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !853)
!852 = !DIFile(filename: "./extra/locale/locale_data.c", directory: "/home/strahinja/build/klee-uclibc")
!853 = !{!854, !849}
!854 = !DIGlobalVariableExpression(var: !855, expr: !DIExpression())
!855 = distinct !DIGlobalVariable(name: "__locale_mmap", scope: !851, file: !856, line: 20149, type: !857, isLocal: false, isDefinition: true)
!856 = !DIFile(filename: "extra/locale/locale_data.c", directory: "/home/strahinja/build/klee-uclibc")
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !859)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_mmap_t", file: !860, line: 91, baseType: !861)
!860 = !DIFile(filename: "./extra/locale/locale_mmap.h", directory: "/home/strahinja/build/klee-uclibc")
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !860, line: 31, size: 2047232, elements: !862)
!862 = !{!863, !867, !871, !875, !879, !883, !887, !891, !895, !899, !903, !907, !911, !928, !932, !934, !936, !940, !942, !946, !950, !954, !958, !962, !966, !970, !974, !978, !982, !986, !987, !991, !995, !999, !1003, !1007}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8ctype", scope: !861, file: !860, line: 37, baseType: !864, size: 3360)
!864 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 3360, elements: !865)
!865 = !{!866}
!866 = !DISubrange(count: 420)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8uplow", scope: !861, file: !860, line: 38, baseType: !868, size: 4032, offset: 3360)
!868 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 4032, elements: !869)
!869 = !{!870}
!870 = !DISubrange(count: 504)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8c2wc", scope: !861, file: !860, line: 40, baseType: !872, size: 28160, offset: 7392)
!872 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 28160, elements: !873)
!873 = !{!874}
!874 = !DISubrange(count: 1760)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8wc2c", scope: !861, file: !860, line: 41, baseType: !876, size: 36224, offset: 35552)
!876 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 36224, elements: !877)
!877 = !{!878}
!878 = !DISubrange(count: 4528)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "tblwctype", scope: !861, file: !860, line: 46, baseType: !880, size: 28832, offset: 71776)
!880 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 28832, elements: !881)
!881 = !{!882}
!882 = !DISubrange(count: 3604)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow", scope: !861, file: !860, line: 47, baseType: !884, size: 13440, offset: 100608)
!884 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 13440, elements: !885)
!885 = !{!886}
!886 = !DISubrange(count: 1680)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow_diff", scope: !861, file: !860, line: 48, baseType: !888, size: 3136, offset: 114048)
!888 = !DICompositeType(tag: DW_TAG_array_type, baseType: !312, size: 3136, elements: !889)
!889 = !{!890}
!890 = !DISubrange(count: 196)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "lc_ctype_data", scope: !861, file: !860, line: 53, baseType: !892, size: 408, offset: 117184)
!892 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 408, elements: !893)
!893 = !{!894}
!894 = !DISubrange(count: 51)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "lc_numeric_data", scope: !861, file: !860, line: 54, baseType: !896, size: 224, offset: 117592)
!896 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 224, elements: !897)
!897 = !{!898}
!898 = !DISubrange(count: 28)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "lc_monetary_data", scope: !861, file: !860, line: 55, baseType: !900, size: 13168, offset: 117816)
!900 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 13168, elements: !901)
!901 = !{!902}
!902 = !DISubrange(count: 1646)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "lc_time_data", scope: !861, file: !860, line: 56, baseType: !904, size: 226824, offset: 130984)
!904 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 226824, elements: !905)
!905 = !{!906}
!906 = !DISubrange(count: 28353)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "lc_messages_data", scope: !861, file: !860, line: 58, baseType: !908, size: 14432, offset: 357808)
!908 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 14432, elements: !909)
!909 = !{!910}
!910 = !DISubrange(count: 1804)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "codeset_8_bit", scope: !861, file: !860, line: 62, baseType: !912, size: 15824, offset: 372240)
!912 = !DICompositeType(tag: DW_TAG_array_type, baseType: !913, size: 15824, elements: !926)
!913 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !914)
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "__codeset_8_bit_t", file: !915, line: 21, baseType: !916)
!915 = !DIFile(filename: "./extra/locale/c8tables.h", directory: "/home/strahinja/build/klee-uclibc")
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !915, line: 16, size: 688, elements: !917)
!917 = !{!918, !920, !921, !922}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "idx8ctype", scope: !916, file: !915, line: 17, baseType: !919, size: 128)
!919 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 128, elements: !450)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "idx8uplow", scope: !916, file: !915, line: 18, baseType: !919, size: 128, offset: 128)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "idx8c2wc", scope: !916, file: !915, line: 19, baseType: !919, size: 128, offset: 256)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "idx8wc2c", scope: !916, file: !915, line: 20, baseType: !923, size: 304, offset: 384)
!923 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 304, elements: !924)
!924 = !{!925}
!925 = !DISubrange(count: 38)
!926 = !{!927}
!927 = !DISubrange(count: 23)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "lc_ctype_rows", scope: !861, file: !860, line: 65, baseType: !929, size: 160, offset: 388064)
!929 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 160, elements: !930)
!930 = !{!931}
!931 = !DISubrange(count: 20)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "lc_ctype_item_offsets", scope: !861, file: !860, line: 65, baseType: !933, size: 160, offset: 388224)
!933 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 160, elements: !297)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "lc_ctype_item_idx", scope: !861, file: !860, line: 65, baseType: !935, size: 320, offset: 388384)
!935 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 320, elements: !930)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "lc_numeric_rows", scope: !861, file: !860, line: 66, baseType: !937, size: 360, offset: 388704)
!937 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 360, elements: !938)
!938 = !{!939}
!939 = !DISubrange(count: 45)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "lc_numeric_item_offsets", scope: !861, file: !860, line: 66, baseType: !941, size: 48, offset: 389072)
!941 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 48, elements: !138)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "lc_numeric_item_idx", scope: !861, file: !860, line: 66, baseType: !943, size: 240, offset: 389120)
!943 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 240, elements: !944)
!944 = !{!945}
!945 = !DISubrange(count: 15)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "lc_monetary_rows", scope: !861, file: !860, line: 67, baseType: !947, size: 31152, offset: 389360)
!947 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 31152, elements: !948)
!948 = !{!949}
!949 = !DISubrange(count: 3894)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "lc_monetary_item_offsets", scope: !861, file: !860, line: 67, baseType: !951, size: 352, offset: 420512)
!951 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 352, elements: !952)
!952 = !{!953}
!953 = !DISubrange(count: 22)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "lc_monetary_item_idx", scope: !861, file: !860, line: 67, baseType: !955, size: 6512, offset: 420864)
!955 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 6512, elements: !956)
!956 = !{!957}
!957 = !DISubrange(count: 407)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "lc_time_rows", scope: !861, file: !860, line: 68, baseType: !959, size: 66000, offset: 427376)
!959 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 66000, elements: !960)
!960 = !{!961}
!961 = !DISubrange(count: 8250)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "lc_time_item_offsets", scope: !861, file: !860, line: 68, baseType: !963, size: 800, offset: 493376)
!963 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 800, elements: !964)
!964 = !{!965}
!965 = !DISubrange(count: 50)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "lc_time_item_idx", scope: !861, file: !860, line: 68, baseType: !967, size: 54864, offset: 494176)
!967 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 54864, elements: !968)
!968 = !{!969}
!969 = !DISubrange(count: 3429)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "lc_messages_rows", scope: !861, file: !860, line: 70, baseType: !971, size: 2976, offset: 549040)
!971 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 2976, elements: !972)
!972 = !{!973}
!973 = !DISubrange(count: 372)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "lc_messages_item_offsets", scope: !861, file: !860, line: 70, baseType: !975, size: 64, offset: 552016)
!975 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 64, elements: !976)
!976 = !{!977}
!977 = !DISubrange(count: 4)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "lc_messages_item_idx", scope: !861, file: !860, line: 70, baseType: !979, size: 3200, offset: 552080)
!979 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 3200, elements: !980)
!980 = !{!981}
!981 = !DISubrange(count: 200)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "collate_data", scope: !861, file: !860, line: 72, baseType: !983, size: 1458256, offset: 555280)
!983 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 1458256, elements: !984)
!984 = !{!985}
!985 = !DISubrange(count: 91141)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "lc_common_item_offsets_LEN", scope: !861, file: !860, line: 74, baseType: !292, size: 48, offset: 2013536)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "lc_common_tbl_offsets", scope: !861, file: !860, line: 75, baseType: !988, size: 1536, offset: 2013632)
