; ModuleID = '__uClibc_main.os'
source_filename = "libc/misc/internals/__uClibc_main.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

module asm ".section .gnu.warning.__fpending"
module asm "\09.previous"

%struct.__uclibc_locale_struct.201 = type { i16*, i16*, i16*, [384 x i16], [384 x i16], [384 x i16], [14 x i8], [6 x i16], [6 x i8], i8, i8, [10 x i8], i8*, i8*, i8*, i8*, i8*, i16*, i8*, i8*, i16*, i8*, i8*, i16*, i32, i32, i32, i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct.__collate_t.200 }
%struct.__collate_t.200 = type { i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16 }
%struct.__STDIO_FILE_STRUCT.568 = type { i16, [2 x i8], i32, i8*, i8*, i8*, i8*, i8*, i8*, %struct.__STDIO_FILE_STRUCT.568*, [2 x i32], %struct.timezone, i8* }
%struct.timezone = type { i32, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.numname = type { i32, [8 x i8] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__libc_stack_end", scope: !2, file: !3, line: 52, type: !6, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !26)
!3 = !DIFile(filename: "libc/misc/internals/__uClibc_main.c", directory: "/home/strahinja/build/klee-uclibc")
!4 = !{}
!5 = !{!6, !7, !9, !11, !23, !25}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_auxv_t", file: !13, line: 1036, baseType: !14)
!13 = !DIFile(filename: "./include/elf.h", directory: "/home/strahinja/build/klee-uclibc")
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 1026, size: 128, elements: !15)
!15 = !{!16, !19}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "a_type", scope: !14, file: !13, line: 1028, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !18, line: 58, baseType: !10)
!18 = !DIFile(filename: "./include/stdint.h", directory: "/home/strahinja/build/klee-uclibc")
!19 = !DIDerivedType(tag: DW_TAG_member, name: "a_un", scope: !14, file: !13, line: 1035, baseType: !20, size: 64, offset: 64)
!20 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !14, file: !13, line: 1029, size: 64, elements: !21)
!21 = !{!22}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "a_val", scope: !20, file: !13, line: 1031, baseType: !17, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !24, line: 62, baseType: !10)
!24 = !DIFile(filename: "/usr/lib/llvm-6.0/lib/clang/6.0.0/include/stddef.h", directory: "/home/strahinja/build/klee-uclibc")
!25 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!26 = !{!0, !27, !31, !33, !35, !38, !40, !46, !49}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "__uclibc_progname", scope: !2, file: !3, line: 110, type: !29, isLocal: false, isDefinition: true)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "program_invocation_short_name", scope: !2, file: !3, line: 112, type: !29, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "program_invocation_name", scope: !2, file: !3, line: 113, type: !29, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "__environ", scope: !2, file: !3, line: 125, type: !37, isLocal: false, isDefinition: true)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(name: "__pagesize", scope: !2, file: !3, line: 129, type: !23, isLocal: false, isDefinition: true)
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(name: "been_there_done_that", scope: !42, file: !3, line: 189, type: !45, isLocal: true, isDefinition: true)
!42 = distinct !DISubprogram(name: "__uClibc_init", scope: !3, file: !3, line: 187, type: !43, isLocal: false, isDefinition: true, scopeLine: 188, flags: DIFlagPrototyped, isOptimized: false, unit: !2, variables: !4)
!43 = !DISubroutineType(types: !44)
!44 = !{null}
!45 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "__app_fini", scope: !2, file: !3, line: 244, type: !48, isLocal: false, isDefinition: true)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!49 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression())
!50 = distinct !DIGlobalVariable(name: "__rtld_fini", scope: !2, file: !3, line: 247, type: !48, isLocal: false, isDefinition: true)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "n_calls", scope: !53, file: !54, line: 1342, type: !45, isLocal: true, isDefinition: true)
!53 = distinct !DISubprogram(name: "getcwd", scope: !54, file: !54, line: 1341, type: !55, isLocal: false, isDefinition: true, scopeLine: 1341, flags: DIFlagPrototyped, isOptimized: false, unit: !59, variables: !4)
!54 = !DIFile(filename: "/home/strahinja/repo/klee/runtime/POSIX/fd.c", directory: "/home/strahinja/repo/runtime/POSIX")
!55 = !DISubroutineType(types: !56)
!56 = !{!7, !7, !57}
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !58, line: 62, baseType: !10)
!58 = !DIFile(filename: "/usr/lib/llvm-6.0/lib/clang/6.0.0/include/stddef.h", directory: "/home/strahinja/repo/runtime/POSIX")
!59 = distinct !DICompileUnit(language: DW_LANG_C89, file: !54, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !60, retainedTypes: !80, globals: !140)
!60 = !{!61, !68}
!61 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !62, line: 46, size: 32, elements: !63)
!62 = !DIFile(filename: "/home/strahinja/repo/klee/runtime/POSIX/fd.h", directory: "/home/strahinja/repo/runtime/POSIX")
!63 = !{!64, !65, !66, !67}
!64 = !DIEnumerator(name: "eOpen", value: 1)
!65 = !DIEnumerator(name: "eCloseOnExec", value: 2)
!66 = !DIEnumerator(name: "eReadable", value: 4)
!67 = !DIEnumerator(name: "eWriteable", value: 8)
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !69, line: 97, size: 32, elements: !70)
!69 = !DIFile(filename: "/usr/include/dirent.h", directory: "/home/strahinja/repo/runtime/POSIX")
!70 = !{!71, !72, !73, !74, !75, !76, !77, !78, !79}
!71 = !DIEnumerator(name: "DT_UNKNOWN", value: 0)
!72 = !DIEnumerator(name: "DT_FIFO", value: 1)
!73 = !DIEnumerator(name: "DT_CHR", value: 2)
!74 = !DIEnumerator(name: "DT_DIR", value: 4)
!75 = !DIEnumerator(name: "DT_BLK", value: 6)
!76 = !DIEnumerator(name: "DT_REG", value: 8)
!77 = !DIEnumerator(name: "DT_LNK", value: 10)
!78 = !DIEnumerator(name: "DT_SOCK", value: 12)
!79 = !DIEnumerator(name: "DT_WHT", value: 14)
!80 = !{!81, !6, !82, !10, !86, !7, !101, !45, !8}
!81 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "off64_t", file: !83, line: 93, baseType: !84)
!83 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/strahinja/repo/runtime/POSIX")
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !85, line: 141, baseType: !81)
!85 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/strahinja/repo/runtime/POSIX")
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent64", file: !88, line: 37, size: 2240, elements: !89)
!88 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "/home/strahinja/repo/runtime/POSIX")
!89 = !{!90, !92, !93, !95, !97}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !87, file: !88, line: 39, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !85, line: 137, baseType: !10)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !87, file: !88, line: 40, baseType: !84, size: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !87, file: !88, line: 41, baseType: !94, size: 16, offset: 128)
!94 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !87, file: !88, line: 42, baseType: !96, size: 8, offset: 144)
!96 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !87, file: !88, line: 43, baseType: !98, size: 2048, offset: 152)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 2048, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 256)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !103, line: 46, size: 1152, elements: !104)
!103 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "/home/strahinja/repo/runtime/POSIX")
!104 = !{!105, !107, !109, !111, !114, !116, !118, !119, !120, !122, !124, !126, !134, !135, !136}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !102, file: !103, line: 48, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !85, line: 133, baseType: !10)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !102, file: !103, line: 53, baseType: !108, size: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !85, line: 136, baseType: !10)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !102, file: !103, line: 61, baseType: !110, size: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !85, line: 139, baseType: !10)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !102, file: !103, line: 62, baseType: !112, size: 32, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !85, line: 138, baseType: !113)
!113 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !102, file: !103, line: 64, baseType: !115, size: 32, offset: 224)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !85, line: 134, baseType: !113)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !102, file: !103, line: 65, baseType: !117, size: 32, offset: 256)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !85, line: 135, baseType: !113)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !102, file: !103, line: 67, baseType: !45, size: 32, offset: 288)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !102, file: !103, line: 69, baseType: !106, size: 64, offset: 320)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !102, file: !103, line: 74, baseType: !121, size: 64, offset: 384)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !85, line: 140, baseType: !81)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !102, file: !103, line: 78, baseType: !123, size: 64, offset: 448)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !85, line: 162, baseType: !81)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !102, file: !103, line: 80, baseType: !125, size: 64, offset: 512)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !85, line: 167, baseType: !81)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !102, file: !103, line: 91, baseType: !127, size: 128, offset: 576)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !128, line: 8, size: 128, elements: !129)
!128 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "/home/strahinja/repo/runtime/POSIX")
!129 = !{!130, !132}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !127, file: !128, line: 10, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !85, line: 148, baseType: !81)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !127, file: !128, line: 11, baseType: !133, size: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !85, line: 184, baseType: !81)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !102, file: !103, line: 92, baseType: !127, size: 128, offset: 704)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !102, file: !103, line: 93, baseType: !127, size: 128, offset: 832)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !102, file: !103, line: 106, baseType: !137, size: 192, offset: 960)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 192, elements: !138)
!138 = !{!139}
!139 = !DISubrange(count: 3)
!140 = !{!141, !146, !153, !160, !166, !171, !51}
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(name: "n_calls", scope: !143, file: !54, line: 313, type: !45, isLocal: true, isDefinition: true)
!143 = distinct !DISubprogram(name: "close", scope: !54, file: !54, line: 312, type: !144, isLocal: false, isDefinition: true, scopeLine: 312, flags: DIFlagPrototyped, isOptimized: false, unit: !59, variables: !4)
!144 = !DISubroutineType(types: !145)
!145 = !{!45, !45}
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(name: "n_calls", scope: !148, file: !54, line: 345, type: !45, isLocal: true, isDefinition: true)
!148 = distinct !DISubprogram(name: "read", scope: !54, file: !54, line: 344, type: !149, isLocal: false, isDefinition: true, scopeLine: 344, flags: DIFlagPrototyped, isOptimized: false, unit: !59, variables: !4)
!149 = !DISubroutineType(types: !150)
!150 = !{!151, !45, !6, !57}
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !83, line: 109, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !85, line: 181, baseType: !81)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "n_calls", scope: !155, file: !54, line: 411, type: !45, isLocal: true, isDefinition: true)
!155 = distinct !DISubprogram(name: "write", scope: !54, file: !54, line: 410, type: !156, isLocal: false, isDefinition: true, scopeLine: 410, flags: DIFlagPrototyped, isOptimized: false, unit: !59, variables: !4)
!156 = !DISubroutineType(types: !157)
!157 = !{!151, !45, !158, !57}
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "n_calls", scope: !162, file: !54, line: 642, type: !45, isLocal: true, isDefinition: true)
!162 = distinct !DISubprogram(name: "chmod", scope: !54, file: !54, line: 641, type: !163, isLocal: false, isDefinition: true, scopeLine: 641, flags: DIFlagPrototyped, isOptimized: false, unit: !59, variables: !4)
!163 = !DISubroutineType(types: !164)
!164 = !{!45, !29, !165}
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !83, line: 70, baseType: !112)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "n_calls", scope: !168, file: !54, line: 661, type: !45, isLocal: true, isDefinition: true)
!168 = distinct !DISubprogram(name: "fchmod", scope: !54, file: !54, line: 660, type: !169, isLocal: false, isDefinition: true, scopeLine: 660, flags: DIFlagPrototyped, isOptimized: false, unit: !59, variables: !4)
!169 = !DISubroutineType(types: !170)
!170 = !{!45, !45, !165}
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(name: "n_calls", scope: !173, file: !54, line: 747, type: !45, isLocal: true, isDefinition: true)
!173 = distinct !DISubprogram(name: "__fd_ftruncate", scope: !54, file: !54, line: 746, type: !174, isLocal: false, isDefinition: true, scopeLine: 746, flags: DIFlagPrototyped, isOptimized: false, unit: !59, variables: !4)
!174 = !DISubroutineType(types: !175)
!175 = !{!45, !45, !82}
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(name: "__global_locale_data", scope: !178, file: !213, line: 375, type: !452, isLocal: false, isDefinition: true)
!178 = distinct !DICompileUnit(language: DW_LANG_C99, file: !179, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !180, retainedTypes: !202, globals: !255)
!179 = !DIFile(filename: "libc/misc/locale/_locale_init.c", directory: "/home/strahinja/build/klee-uclibc")
!180 = !{!181, !187}
!181 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !182, line: 90, size: 32, elements: !183)
!182 = !DIFile(filename: "./include/bits/uClibc_locale.h", directory: "/home/strahinja/build/klee-uclibc")
!183 = !{!184, !185, !186}
!184 = !DIEnumerator(name: "__ctype_encoding_7_bit", value: 0)
!185 = !DIEnumerator(name: "__ctype_encoding_utf8", value: 1)
!186 = !DIEnumerator(name: "__ctype_encoding_8_bit", value: 2)
!187 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !188, line: 48, size: 32, elements: !189)
!188 = !DIFile(filename: "./include/ctype.h", directory: "/home/strahinja/build/klee-uclibc")
!189 = !{!190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201}
!190 = !DIEnumerator(name: "_ISupper", value: 256)
!191 = !DIEnumerator(name: "_ISlower", value: 512)
!192 = !DIEnumerator(name: "_ISalpha", value: 1024)
!193 = !DIEnumerator(name: "_ISdigit", value: 2048)
!194 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!195 = !DIEnumerator(name: "_ISspace", value: 8192)
!196 = !DIEnumerator(name: "_ISprint", value: 16384)
!197 = !DIEnumerator(name: "_ISgraph", value: 32768)
!198 = !DIEnumerator(name: "_ISblank", value: 1)
!199 = !DIEnumerator(name: "_IScntrl", value: 2)
!200 = !DIEnumerator(name: "_ISpunct", value: 4)
!201 = !DIEnumerator(name: "_ISalnum", value: 8)
!202 = !{!45, !203, !7, !204, !206, !209, !96, !210, !211, !224, !232, !10}
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !96)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !18, line: 52, baseType: !94)
!209 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_header_t", file: !213, line: 400, baseType: !214)
!213 = !DIFile(filename: "libc/misc/locale/locale.c", directory: "/home/strahinja/build/klee-uclibc")
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !213, line: 390, size: 128, elements: !215)
!215 = !{!216, !217, !218, !219, !220, !221, !222, !223}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "num_base", scope: !214, file: !213, line: 391, baseType: !208, size: 16)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "num_der", scope: !214, file: !213, line: 392, baseType: !208, size: 16, offset: 16)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "MAX_WEIGHTS", scope: !214, file: !213, line: 393, baseType: !208, size: 16, offset: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "num_index2weight", scope: !214, file: !213, line: 394, baseType: !208, size: 16, offset: 48)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "num_weightstr", scope: !214, file: !213, line: 396, baseType: !208, size: 16, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "num_multistart", scope: !214, file: !213, line: 397, baseType: !208, size: 16, offset: 80)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "num_override", scope: !214, file: !213, line: 398, baseType: !208, size: 16, offset: 96)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "num_ruletable", scope: !214, file: !213, line: 399, baseType: !208, size: 16, offset: 112)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_der_t", file: !213, line: 430, baseType: !226)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !213, line: 425, size: 64, elements: !227)
!227 = !{!228, !229, !230, !231}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "base_idx", scope: !226, file: !213, line: 426, baseType: !208, size: 16)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !226, file: !213, line: 427, baseType: !208, size: 16, offset: 16)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "overrides_offset", scope: !226, file: !213, line: 428, baseType: !208, size: 16, offset: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_offset", scope: !226, file: !213, line: 429, baseType: !208, size: 16, offset: 48)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_base_t", file: !213, line: 423, baseType: !234)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !213, line: 402, size: 304, elements: !235)
!235 = !{!236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "num_weights", scope: !234, file: !213, line: 403, baseType: !208, size: 16)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "num_starters", scope: !234, file: !213, line: 404, baseType: !208, size: 16, offset: 16)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "ii_shift", scope: !234, file: !213, line: 405, baseType: !208, size: 16, offset: 32)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "ti_shift", scope: !234, file: !213, line: 406, baseType: !208, size: 16, offset: 48)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "ii_len", scope: !234, file: !213, line: 407, baseType: !208, size: 16, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "ti_len", scope: !234, file: !213, line: 408, baseType: !208, size: 16, offset: 80)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "max_weight", scope: !234, file: !213, line: 409, baseType: !208, size: 16, offset: 96)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "num_col_base", scope: !234, file: !213, line: 410, baseType: !208, size: 16, offset: 112)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "max_col_index", scope: !234, file: !213, line: 411, baseType: !208, size: 16, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !234, file: !213, line: 412, baseType: !208, size: 16, offset: 144)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "range_low", scope: !234, file: !213, line: 413, baseType: !208, size: 16, offset: 160)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "range_count", scope: !234, file: !213, line: 414, baseType: !208, size: 16, offset: 176)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "range_base_weight", scope: !234, file: !213, line: 415, baseType: !208, size: 16, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "range_rule_offset", scope: !234, file: !213, line: 416, baseType: !208, size: 16, offset: 208)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight_offset", scope: !234, file: !213, line: 418, baseType: !208, size: 16, offset: 224)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx_offset", scope: !234, file: !213, line: 419, baseType: !208, size: 16, offset: 240)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_offset", scope: !234, file: !213, line: 420, baseType: !208, size: 16, offset: 256)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_offset_low", scope: !234, file: !213, line: 421, baseType: !208, size: 16, offset: 272)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_offset_hi", scope: !234, file: !213, line: 422, baseType: !208, size: 16, offset: 288)
!255 = !{!256, !440, !176, !442, !445, !447}
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(name: "__global_locale", scope: !178, file: !213, line: 377, type: !258, isLocal: false, isDefinition: true)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_t", file: !182, line: 330, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__uclibc_locale_struct", file: !182, line: 154, size: 26560, elements: !261)
!261 = !{!262, !269, !275, !276, !280, !282, !283, !287, !291, !293, !294, !295, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !314, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b", scope: !260, file: !182, line: 156, baseType: !263, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !265)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ctype_mask_t", file: !266, line: 38, baseType: !267)
!266 = !DIFile(filename: "./include/bits/uClibc_touplow.h", directory: "/home/strahinja/build/klee-uclibc")
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !268, line: 44, baseType: !94)
!268 = !DIFile(filename: "./include/bits/types.h", directory: "/home/strahinja/build/klee-uclibc")
!269 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower", scope: !260, file: !182, line: 157, baseType: !270, size: 64, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ctype_touplow_t", file: !266, line: 42, baseType: !273)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !268, line: 43, baseType: !274)
!274 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper", scope: !260, file: !182, line: 158, baseType: !270, size: 64, offset: 128)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b_data", scope: !260, file: !182, line: 162, baseType: !277, size: 6144, offset: 192)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !265, size: 6144, elements: !278)
!278 = !{!279}
!279 = !DISubrange(count: 384)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower_data", scope: !260, file: !182, line: 163, baseType: !281, size: 6144, offset: 6336)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 6144, elements: !278)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper_data", scope: !260, file: !182, line: 164, baseType: !281, size: 6144, offset: 12480)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "cur_locale", scope: !260, file: !182, line: 168, baseType: !284, size: 112, offset: 18624)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 112, elements: !285)
!285 = !{!286}
!286 = !DISubrange(count: 14)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "category_offsets", scope: !260, file: !182, line: 174, baseType: !288, size: 96, offset: 18736)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 96, elements: !289)
!289 = !{!290}
!290 = !DISubrange(count: 6)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "category_item_count", scope: !260, file: !182, line: 175, baseType: !292, size: 48, offset: 18832)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 48, elements: !289)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !260, file: !182, line: 178, baseType: !96, size: 8, offset: 18880)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cur_max", scope: !260, file: !182, line: 179, baseType: !96, size: 8, offset: 18888)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit_length", scope: !260, file: !182, line: 180, baseType: !296, size: 80, offset: 18896)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 80, elements: !297)
!297 = !{!298}
!298 = !DISubrange(count: 10)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "idx8ctype", scope: !260, file: !182, line: 183, baseType: !204, size: 64, offset: 19008)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8ctype", scope: !260, file: !182, line: 184, baseType: !204, size: 64, offset: 19072)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "idx8uplow", scope: !260, file: !182, line: 185, baseType: !204, size: 64, offset: 19136)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8uplow", scope: !260, file: !182, line: 186, baseType: !204, size: 64, offset: 19200)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "idx8c2wc", scope: !260, file: !182, line: 188, baseType: !204, size: 64, offset: 19264)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8c2wc", scope: !260, file: !182, line: 189, baseType: !206, size: 64, offset: 19328)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "idx8wc2c", scope: !260, file: !182, line: 190, baseType: !204, size: 64, offset: 19392)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8wc2c", scope: !260, file: !182, line: 191, baseType: !204, size: 64, offset: 19456)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "code2flag", scope: !260, file: !182, line: 197, baseType: !206, size: 64, offset: 19520)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "tblwctype", scope: !260, file: !182, line: 199, baseType: !204, size: 64, offset: 19584)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow", scope: !260, file: !182, line: 200, baseType: !204, size: 64, offset: 19648)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow_diff", scope: !260, file: !182, line: 202, baseType: !311, size: 64, offset: 19712)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !313)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !18, line: 40, baseType: !274)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point_wc", scope: !260, file: !182, line: 205, baseType: !315, size: 32, offset: 19776)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !24, line: 90, baseType: !45)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep_wc", scope: !260, file: !182, line: 206, baseType: !315, size: 32, offset: 19808)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point_len", scope: !260, file: !182, line: 207, baseType: !45, size: 32, offset: 19840)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep_len", scope: !260, file: !182, line: 208, baseType: !45, size: 32, offset: 19872)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit0_mb", scope: !260, file: !182, line: 213, baseType: !29, size: 64, offset: 19904)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit1_mb", scope: !260, file: !182, line: 214, baseType: !29, size: 64, offset: 19968)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit2_mb", scope: !260, file: !182, line: 215, baseType: !29, size: 64, offset: 20032)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit3_mb", scope: !260, file: !182, line: 216, baseType: !29, size: 64, offset: 20096)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit4_mb", scope: !260, file: !182, line: 217, baseType: !29, size: 64, offset: 20160)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit5_mb", scope: !260, file: !182, line: 218, baseType: !29, size: 64, offset: 20224)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit6_mb", scope: !260, file: !182, line: 219, baseType: !29, size: 64, offset: 20288)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit7_mb", scope: !260, file: !182, line: 220, baseType: !29, size: 64, offset: 20352)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit8_mb", scope: !260, file: !182, line: 221, baseType: !29, size: 64, offset: 20416)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit9_mb", scope: !260, file: !182, line: 222, baseType: !29, size: 64, offset: 20480)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "codeset", scope: !260, file: !182, line: 223, baseType: !29, size: 64, offset: 20544)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !260, file: !182, line: 226, baseType: !29, size: 64, offset: 20608)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !260, file: !182, line: 227, baseType: !29, size: 64, offset: 20672)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !260, file: !182, line: 228, baseType: !29, size: 64, offset: 20736)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !260, file: !182, line: 231, baseType: !29, size: 64, offset: 20800)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !260, file: !182, line: 232, baseType: !29, size: 64, offset: 20864)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !260, file: !182, line: 233, baseType: !29, size: 64, offset: 20928)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !260, file: !182, line: 234, baseType: !29, size: 64, offset: 20992)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !260, file: !182, line: 235, baseType: !29, size: 64, offset: 21056)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !260, file: !182, line: 236, baseType: !29, size: 64, offset: 21120)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !260, file: !182, line: 237, baseType: !29, size: 64, offset: 21184)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !260, file: !182, line: 238, baseType: !29, size: 64, offset: 21248)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !260, file: !182, line: 239, baseType: !29, size: 64, offset: 21312)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !260, file: !182, line: 240, baseType: !29, size: 64, offset: 21376)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !260, file: !182, line: 241, baseType: !29, size: 64, offset: 21440)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !260, file: !182, line: 242, baseType: !29, size: 64, offset: 21504)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !260, file: !182, line: 243, baseType: !29, size: 64, offset: 21568)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !260, file: !182, line: 244, baseType: !29, size: 64, offset: 21632)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !260, file: !182, line: 245, baseType: !29, size: 64, offset: 21696)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !260, file: !182, line: 246, baseType: !29, size: 64, offset: 21760)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !260, file: !182, line: 247, baseType: !29, size: 64, offset: 21824)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !260, file: !182, line: 248, baseType: !29, size: 64, offset: 21888)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !260, file: !182, line: 249, baseType: !29, size: 64, offset: 21952)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !260, file: !182, line: 250, baseType: !29, size: 64, offset: 22016)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !260, file: !182, line: 251, baseType: !29, size: 64, offset: 22080)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "crncystr", scope: !260, file: !182, line: 253, baseType: !29, size: 64, offset: 22144)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "abday_1", scope: !260, file: !182, line: 256, baseType: !29, size: 64, offset: 22208)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "abday_2", scope: !260, file: !182, line: 257, baseType: !29, size: 64, offset: 22272)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "abday_3", scope: !260, file: !182, line: 258, baseType: !29, size: 64, offset: 22336)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "abday_4", scope: !260, file: !182, line: 259, baseType: !29, size: 64, offset: 22400)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "abday_5", scope: !260, file: !182, line: 260, baseType: !29, size: 64, offset: 22464)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "abday_6", scope: !260, file: !182, line: 261, baseType: !29, size: 64, offset: 22528)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "abday_7", scope: !260, file: !182, line: 262, baseType: !29, size: 64, offset: 22592)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "day_1", scope: !260, file: !182, line: 264, baseType: !29, size: 64, offset: 22656)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "day_2", scope: !260, file: !182, line: 265, baseType: !29, size: 64, offset: 22720)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "day_3", scope: !260, file: !182, line: 266, baseType: !29, size: 64, offset: 22784)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "day_4", scope: !260, file: !182, line: 267, baseType: !29, size: 64, offset: 22848)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "day_5", scope: !260, file: !182, line: 268, baseType: !29, size: 64, offset: 22912)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "day_6", scope: !260, file: !182, line: 269, baseType: !29, size: 64, offset: 22976)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "day_7", scope: !260, file: !182, line: 270, baseType: !29, size: 64, offset: 23040)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_1", scope: !260, file: !182, line: 272, baseType: !29, size: 64, offset: 23104)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_2", scope: !260, file: !182, line: 273, baseType: !29, size: 64, offset: 23168)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_3", scope: !260, file: !182, line: 274, baseType: !29, size: 64, offset: 23232)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_4", scope: !260, file: !182, line: 275, baseType: !29, size: 64, offset: 23296)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_5", scope: !260, file: !182, line: 276, baseType: !29, size: 64, offset: 23360)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_6", scope: !260, file: !182, line: 277, baseType: !29, size: 64, offset: 23424)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_7", scope: !260, file: !182, line: 278, baseType: !29, size: 64, offset: 23488)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_8", scope: !260, file: !182, line: 279, baseType: !29, size: 64, offset: 23552)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_9", scope: !260, file: !182, line: 280, baseType: !29, size: 64, offset: 23616)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_10", scope: !260, file: !182, line: 281, baseType: !29, size: 64, offset: 23680)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_11", scope: !260, file: !182, line: 282, baseType: !29, size: 64, offset: 23744)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_12", scope: !260, file: !182, line: 283, baseType: !29, size: 64, offset: 23808)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "mon_1", scope: !260, file: !182, line: 285, baseType: !29, size: 64, offset: 23872)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "mon_2", scope: !260, file: !182, line: 286, baseType: !29, size: 64, offset: 23936)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "mon_3", scope: !260, file: !182, line: 287, baseType: !29, size: 64, offset: 24000)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "mon_4", scope: !260, file: !182, line: 288, baseType: !29, size: 64, offset: 24064)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "mon_5", scope: !260, file: !182, line: 289, baseType: !29, size: 64, offset: 24128)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "mon_6", scope: !260, file: !182, line: 290, baseType: !29, size: 64, offset: 24192)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "mon_7", scope: !260, file: !182, line: 291, baseType: !29, size: 64, offset: 24256)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "mon_8", scope: !260, file: !182, line: 292, baseType: !29, size: 64, offset: 24320)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "mon_9", scope: !260, file: !182, line: 293, baseType: !29, size: 64, offset: 24384)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "mon_10", scope: !260, file: !182, line: 294, baseType: !29, size: 64, offset: 24448)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "mon_11", scope: !260, file: !182, line: 295, baseType: !29, size: 64, offset: 24512)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "mon_12", scope: !260, file: !182, line: 296, baseType: !29, size: 64, offset: 24576)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "am_str", scope: !260, file: !182, line: 298, baseType: !29, size: 64, offset: 24640)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "pm_str", scope: !260, file: !182, line: 299, baseType: !29, size: 64, offset: 24704)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "d_t_fmt", scope: !260, file: !182, line: 301, baseType: !29, size: 64, offset: 24768)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "d_fmt", scope: !260, file: !182, line: 302, baseType: !29, size: 64, offset: 24832)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "t_fmt", scope: !260, file: !182, line: 303, baseType: !29, size: 64, offset: 24896)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "t_fmt_ampm", scope: !260, file: !182, line: 304, baseType: !29, size: 64, offset: 24960)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "era", scope: !260, file: !182, line: 305, baseType: !29, size: 64, offset: 25024)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "era_year", scope: !260, file: !182, line: 307, baseType: !29, size: 64, offset: 25088)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "era_d_fmt", scope: !260, file: !182, line: 308, baseType: !29, size: 64, offset: 25152)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "alt_digits", scope: !260, file: !182, line: 309, baseType: !29, size: 64, offset: 25216)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "era_d_t_fmt", scope: !260, file: !182, line: 310, baseType: !29, size: 64, offset: 25280)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "era_t_fmt", scope: !260, file: !182, line: 311, baseType: !29, size: 64, offset: 25344)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "yesexpr", scope: !260, file: !182, line: 316, baseType: !29, size: 64, offset: 25408)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "noexpr", scope: !260, file: !182, line: 317, baseType: !29, size: 64, offset: 25472)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "yesstr", scope: !260, file: !182, line: 318, baseType: !29, size: 64, offset: 25536)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "nostr", scope: !260, file: !182, line: 319, baseType: !29, size: 64, offset: 25600)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "collate", scope: !260, file: !182, line: 322, baseType: !410, size: 896, offset: 25664)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "__collate_t", file: !182, line: 149, baseType: !411)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !182, line: 111, size: 896, elements: !412)
!412 = !{!413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !438, !439}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "num_weights", scope: !411, file: !182, line: 112, baseType: !208, size: 16)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "num_starters", scope: !411, file: !182, line: 113, baseType: !208, size: 16, offset: 16)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ii_shift", scope: !411, file: !182, line: 114, baseType: !208, size: 16, offset: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "ti_shift", scope: !411, file: !182, line: 115, baseType: !208, size: 16, offset: 48)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "ii_len", scope: !411, file: !182, line: 116, baseType: !208, size: 16, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "ti_len", scope: !411, file: !182, line: 117, baseType: !208, size: 16, offset: 80)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "max_weight", scope: !411, file: !182, line: 118, baseType: !208, size: 16, offset: 96)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "num_col_base", scope: !411, file: !182, line: 119, baseType: !208, size: 16, offset: 112)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "max_col_index", scope: !411, file: !182, line: 120, baseType: !208, size: 16, offset: 128)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !411, file: !182, line: 121, baseType: !208, size: 16, offset: 144)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "range_low", scope: !411, file: !182, line: 122, baseType: !208, size: 16, offset: 160)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "range_count", scope: !411, file: !182, line: 123, baseType: !208, size: 16, offset: 176)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "range_base_weight", scope: !411, file: !182, line: 124, baseType: !208, size: 16, offset: 192)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "range_rule_offset", scope: !411, file: !182, line: 125, baseType: !208, size: 16, offset: 208)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "ii_mask", scope: !411, file: !182, line: 127, baseType: !208, size: 16, offset: 224)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "ti_mask", scope: !411, file: !182, line: 128, baseType: !208, size: 16, offset: 240)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight_tbl", scope: !411, file: !182, line: 130, baseType: !206, size: 64, offset: 256)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx_tbl", scope: !411, file: !182, line: 131, baseType: !206, size: 64, offset: 320)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_tbl", scope: !411, file: !182, line: 132, baseType: !206, size: 64, offset: 384)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_tbl", scope: !411, file: !182, line: 135, baseType: !206, size: 64, offset: 448)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "overrides_tbl", scope: !411, file: !182, line: 138, baseType: !206, size: 64, offset: 512)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "weightstr", scope: !411, file: !182, line: 141, baseType: !206, size: 64, offset: 576)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "ruletable", scope: !411, file: !182, line: 142, baseType: !206, size: 64, offset: 640)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight", scope: !411, file: !182, line: 145, baseType: !437, size: 64, offset: 704)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx", scope: !411, file: !182, line: 146, baseType: !437, size: 64, offset: 768)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "MAX_WEIGHTS", scope: !411, file: !182, line: 148, baseType: !208, size: 16, offset: 832)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(name: "__curlocale_var", scope: !178, file: !213, line: 380, type: !258, isLocal: false, isDefinition: true)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(name: "utf8", scope: !178, file: !213, line: 387, type: !444, isLocal: true, isDefinition: true)
!444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 48, elements: !289)
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(name: "ascii", scope: !178, file: !213, line: 388, type: !444, isLocal: true, isDefinition: true)
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(name: "__code2flag", scope: !178, file: !213, line: 854, type: !449, isLocal: true, isDefinition: true)
!449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 256, elements: !450)
!450 = !{!451}
!451 = !DISubrange(count: 16)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uclibc_locale_t", file: !182, line: 324, baseType: !260)
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(name: "_stdio_streams", scope: !455, file: !456, line: 131, type: !500, isLocal: true, isDefinition: true)
!455 = distinct !DICompileUnit(language: DW_LANG_C99, file: !456, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !457)
!456 = !DIFile(filename: "libc/stdio/_stdio.c", directory: "/home/strahinja/build/klee-uclibc")
!457 = !{!458, !490, !492, !494, !496, !498, !453}
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(name: "stdin", scope: !455, file: !456, line: 154, type: !460, isLocal: false, isDefinition: true)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !462, line: 46, baseType: !463)
!462 = !DIFile(filename: "./include/stdio.h", directory: "/home/strahinja/build/klee-uclibc")
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__STDIO_FILE_STRUCT", file: !464, line: 233, size: 704, elements: !465)
!464 = !DIFile(filename: "./include/bits/uClibc_stdio.h", directory: "/home/strahinja/build/klee-uclibc")
!465 = !{!466, !467, !471, !472, !473, !474, !475, !476, !477, !478, !480, !482, !489}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "__modeflags", scope: !463, file: !464, line: 234, baseType: !94, size: 16)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "__ungot_width", scope: !463, file: !464, line: 237, baseType: !468, size: 16, offset: 16)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 16, elements: !469)
!469 = !{!470}
!470 = !DISubrange(count: 2)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "__filedes", scope: !463, file: !464, line: 244, baseType: !45, size: 32, offset: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "__bufstart", scope: !463, file: !464, line: 246, baseType: !210, size: 64, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "__bufend", scope: !463, file: !464, line: 247, baseType: !210, size: 64, offset: 128)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "__bufpos", scope: !463, file: !464, line: 248, baseType: !210, size: 64, offset: 192)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "__bufread", scope: !463, file: !464, line: 249, baseType: !210, size: 64, offset: 256)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "__bufgetc_u", scope: !463, file: !464, line: 252, baseType: !210, size: 64, offset: 320)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "__bufputc_u", scope: !463, file: !464, line: 255, baseType: !210, size: 64, offset: 384)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "__nextopen", scope: !463, file: !464, line: 261, baseType: !479, size: 64, offset: 448)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "__ungot", scope: !463, file: !464, line: 268, baseType: !481, size: 64, offset: 512)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !315, size: 64, elements: !469)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "__state", scope: !463, file: !464, line: 271, baseType: !483, size: 64, offset: 576)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !484, line: 85, baseType: !485)
!484 = !DIFile(filename: "./include/wchar.h", directory: "/home/strahinja/build/klee-uclibc")
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !484, line: 81, size: 64, elements: !486)
!486 = !{!487, !488}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "__mask", scope: !485, file: !484, line: 83, baseType: !315, size: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "__wc", scope: !485, file: !484, line: 84, baseType: !315, size: 32, offset: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !463, file: !464, line: 274, baseType: !6, size: 64, offset: 640)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(name: "stdout", scope: !455, file: !456, line: 155, type: !460, isLocal: false, isDefinition: true)
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(name: "stderr", scope: !455, file: !456, line: 156, type: !460, isLocal: false, isDefinition: true)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(name: "__stdin", scope: !455, file: !456, line: 159, type: !460, isLocal: false, isDefinition: true)
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(name: "__stdout", scope: !455, file: !456, line: 162, type: !460, isLocal: false, isDefinition: true)
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(name: "_stdio_openlist", scope: !455, file: !456, line: 180, type: !460, isLocal: false, isDefinition: true)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !461, size: 2112, elements: !138)
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(name: "__exit_cleanup", scope: !503, file: !506, line: 309, type: !507, isLocal: false, isDefinition: true)
!503 = distinct !DICompileUnit(language: DW_LANG_C99, file: !504, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !505)
!504 = !DIFile(filename: "libc/stdlib/exit.c", directory: "/home/strahinja/build/klee-uclibc")
!505 = !{!501}
!506 = !DIFile(filename: "libc/stdlib/_atexit.c", directory: "/home/strahinja/build/klee-uclibc")
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DISubroutineType(types: !509)
!509 = !{null, !45}
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(name: "program_name", scope: !512, file: !513, line: 63, type: !7, isLocal: false, isDefinition: true)
!512 = distinct !DICompileUnit(language: DW_LANG_C99, file: !513, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !514, globals: !515)
!513 = !DIFile(filename: "../../src/kill.c", directory: "/home/strahinja/coreutils-6.11/obj-llvm/src")
!514 = !{!29, !7, !6, !113, !209}
!515 = !{!510, !516, !521}
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(name: "short_options", scope: !512, file: !513, line: 65, type: !518, isLocal: true, isDefinition: true)
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 920, elements: !519)
!519 = !{!520}
!520 = !DISubrange(count: 115)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(name: "long_options", scope: !512, file: !513, line: 71, type: !523, isLocal: true, isDefinition: true)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !524, size: 1536, elements: !289)
!524 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !525)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !526, line: 50, size: 256, elements: !527)
!526 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "/home/strahinja/coreutils-6.11/obj-llvm/src")
!527 = !{!528, !529, !530, !532}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !525, file: !526, line: 52, baseType: !29, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !525, file: !526, line: 55, baseType: !45, size: 32, offset: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !525, file: !526, line: 56, baseType: !531, size: 64, offset: 128)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !525, file: !526, line: 57, baseType: !45, size: 32, offset: 192)
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !535, file: !536, line: 26, type: !538, isLocal: false, isDefinition: true)
!535 = distinct !DICompileUnit(language: DW_LANG_C99, file: !536, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !537)
!536 = !DIFile(filename: "../../lib/version-etc-fsf.c", directory: "/home/strahinja/coreutils-6.11/obj-llvm/lib")
!537 = !{!533}
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 376, elements: !539)
!539 = !{!540}
!540 = !DISubrange(count: 47)
!541 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression())
!542 = distinct !DIGlobalVariable(name: "exit_failure", scope: !543, file: !544, line: 24, type: !546, isLocal: false, isDefinition: true)
!543 = distinct !DICompileUnit(language: DW_LANG_C99, file: !544, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !545)
!544 = !DIFile(filename: "../../lib/exitfail.c", directory: "/home/strahinja/coreutils-6.11/obj-llvm/lib")
!545 = !{!541}
!546 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !45)
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(name: "numname_table", scope: !549, file: !550, line: 41, type: !553, isLocal: true, isDefinition: true)
!549 = distinct !DICompileUnit(language: DW_LANG_C99, file: !550, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !551, globals: !552)
!550 = !DIFile(filename: "../../lib/sig2str.c", directory: "/home/strahinja/coreutils-6.11/obj-llvm/lib")
!551 = !{!113}
!552 = !{!547}
!553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !554, size: 3360, elements: !561)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "numname", file: !550, line: 41, size: 96, elements: !555)
!555 = !{!556, !557}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !554, file: !550, line: 41, baseType: !45, size: 32)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !554, file: !550, line: 41, baseType: !558, size: 64, offset: 32)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 64, elements: !559)
!559 = !{!560}
!560 = !DISubrange(count: 8)
!561 = !{!562}
!562 = !DISubrange(count: 35)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(name: "wide_null_string", scope: !565, file: !566, line: 112, type: !664, isLocal: true, isDefinition: true)
!565 = distinct !DISubprogram(name: "printf_fetchargs", scope: !566, file: !566, line: 36, type: !567, isLocal: false, isDefinition: true, scopeLine: 37, flags: DIFlagPrototyped, isOptimized: true, unit: !655, variables: !659)
!566 = !DIFile(filename: "../../lib/printf-args.c", directory: "/home/strahinja/coreutils-6.11/obj-llvm/lib")
!567 = !DISubroutineType(types: !568)
!568 = !{!45, !569, !576}
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !566, size: 192, elements: !571)
!571 = !{!572, !573, !574, !575}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !570, file: !566, baseType: !113, size: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !570, file: !566, baseType: !113, size: 32, offset: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !570, file: !566, baseType: !6, size: 64, offset: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !570, file: !566, baseType: !6, size: 64, offset: 128)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "arguments", file: !578, line: 143, baseType: !579)
!578 = !DIFile(filename: "../../lib/printf-args.h", directory: "/home/strahinja/coreutils-6.11/obj-llvm/lib")
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !578, line: 138, size: 128, elements: !580)
!580 = !{!581, !584}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !579, file: !578, line: 140, baseType: !582, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !583, line: 62, baseType: !10)
!583 = !DIFile(filename: "/usr/lib/llvm-6.0/lib/clang/6.0.0/include/stddef.h", directory: "/home/strahinja/coreutils-6.11/obj-llvm/lib")
!584 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !579, file: !578, line: 141, baseType: !585, size: 64, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "argument", file: !578, line: 136, baseType: !587)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !578, line: 91, size: 256, elements: !588)
!588 = !{!589, !616}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !587, file: !578, line: 93, baseType: !590, size: 32)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "arg_type", file: !578, line: 88, baseType: !591)
!591 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !578, line: 49, size: 32, elements: !592)
!592 = !{!593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615}
!593 = !DIEnumerator(name: "TYPE_NONE", value: 0)
!594 = !DIEnumerator(name: "TYPE_SCHAR", value: 1)
!595 = !DIEnumerator(name: "TYPE_UCHAR", value: 2)
!596 = !DIEnumerator(name: "TYPE_SHORT", value: 3)
!597 = !DIEnumerator(name: "TYPE_USHORT", value: 4)
!598 = !DIEnumerator(name: "TYPE_INT", value: 5)
!599 = !DIEnumerator(name: "TYPE_UINT", value: 6)
!600 = !DIEnumerator(name: "TYPE_LONGINT", value: 7)
!601 = !DIEnumerator(name: "TYPE_ULONGINT", value: 8)
!602 = !DIEnumerator(name: "TYPE_LONGLONGINT", value: 9)
!603 = !DIEnumerator(name: "TYPE_ULONGLONGINT", value: 10)
!604 = !DIEnumerator(name: "TYPE_DOUBLE", value: 11)
!605 = !DIEnumerator(name: "TYPE_LONGDOUBLE", value: 12)
!606 = !DIEnumerator(name: "TYPE_CHAR", value: 13)
!607 = !DIEnumerator(name: "TYPE_WIDE_CHAR", value: 14)
!608 = !DIEnumerator(name: "TYPE_STRING", value: 15)
!609 = !DIEnumerator(name: "TYPE_WIDE_STRING", value: 16)
!610 = !DIEnumerator(name: "TYPE_POINTER", value: 17)
!611 = !DIEnumerator(name: "TYPE_COUNT_SCHAR_POINTER", value: 18)
!612 = !DIEnumerator(name: "TYPE_COUNT_SHORT_POINTER", value: 19)
!613 = !DIEnumerator(name: "TYPE_COUNT_INT_POINTER", value: 20)
!614 = !DIEnumerator(name: "TYPE_COUNT_LONGINT_POINTER", value: 21)
!615 = !DIEnumerator(name: "TYPE_COUNT_LONGLONGINT_POINTER", value: 22)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !587, file: !578, line: 134, baseType: !617, size: 128, offset: 128)
!617 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !587, file: !578, line: 94, size: 128, elements: !618)
!618 = !{!619, !620, !621, !622, !623, !624, !625, !626, !627, !629, !630, !632, !634, !636, !637, !640, !641, !645, !646, !648, !650, !651, !653}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "a_schar", scope: !617, file: !578, line: 96, baseType: !209, size: 8)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "a_uchar", scope: !617, file: !578, line: 97, baseType: !96, size: 8)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "a_short", scope: !617, file: !578, line: 98, baseType: !274, size: 16)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "a_ushort", scope: !617, file: !578, line: 99, baseType: !94, size: 16)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "a_int", scope: !617, file: !578, line: 100, baseType: !45, size: 32)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint", scope: !617, file: !578, line: 101, baseType: !113, size: 32)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "a_longint", scope: !617, file: !578, line: 102, baseType: !81, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulongint", scope: !617, file: !578, line: 103, baseType: !10, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "a_longlongint", scope: !617, file: !578, line: 105, baseType: !628, size: 64)
!628 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulonglongint", scope: !617, file: !578, line: 106, baseType: !25, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "a_float", scope: !617, file: !578, line: 108, baseType: !631, size: 32)
!631 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "a_double", scope: !617, file: !578, line: 109, baseType: !633, size: 64)
!633 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "a_longdouble", scope: !617, file: !578, line: 110, baseType: !635, size: 128)
!635 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "a_char", scope: !617, file: !578, line: 111, baseType: !45, size: 32)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_char", scope: !617, file: !578, line: 113, baseType: !638, size: 32)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !639, line: 20, baseType: !113)
!639 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/wint_t.h", directory: "/home/strahinja/coreutils-6.11/obj-llvm/lib")
!640 = !DIDerivedType(tag: DW_TAG_member, name: "a_string", scope: !617, file: !578, line: 115, baseType: !29, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_string", scope: !617, file: !578, line: 117, baseType: !642, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !644)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !583, line: 90, baseType: !45)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "a_pointer", scope: !617, file: !578, line: 119, baseType: !6, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_schar_pointer", scope: !617, file: !578, line: 120, baseType: !647, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_short_pointer", scope: !617, file: !578, line: 121, baseType: !649, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_pointer", scope: !617, file: !578, line: 122, baseType: !531, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longint_pointer", scope: !617, file: !578, line: 123, baseType: !652, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longlongint_pointer", scope: !617, file: !578, line: 125, baseType: !654, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!655 = distinct !DICompileUnit(language: DW_LANG_C99, file: !566, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !656, retainedTypes: !657, globals: !658)
!656 = !{!591}
!657 = !{!6}
!658 = !{!563}
!659 = !{!660, !661, !662, !663}
!660 = !DILocalVariable(name: "args", arg: 1, scope: !565, file: !566, line: 36, type: !569)
!661 = !DILocalVariable(name: "a", arg: 2, scope: !565, file: !566, line: 36, type: !576)
!662 = !DILocalVariable(name: "i", scope: !565, file: !566, line: 38, type: !582)
!663 = !DILocalVariable(name: "ap", scope: !565, file: !566, line: 39, type: !585)
!664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !643, size: 224, elements: !665)
!665 = !{!666}
!666 = !DISubrange(count: 7)
!667 = !DIGlobalVariableExpression(var: !668, expr: !DIExpression())
!668 = distinct !DIGlobalVariable(name: "__exe_env", scope: !669, file: !670, line: 37, type: !720, isLocal: false, isDefinition: true)
!669 = distinct !DICompileUnit(language: DW_LANG_C89, file: !670, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !671)
!670 = !DIFile(filename: "/home/strahinja/repo/klee/runtime/POSIX/fd_init.c", directory: "/home/strahinja/repo/runtime/POSIX")
!671 = !{!667, !672}
!672 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression())
!673 = distinct !DIGlobalVariable(name: "__exe_fs", scope: !669, file: !670, line: 24, type: !674, isLocal: false, isDefinition: true)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "exe_file_system_t", file: !62, line: 74, baseType: !675)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !62, line: 62, size: 832, elements: !676)
!676 = !{!677, !678, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "n_sym_files", scope: !675, file: !62, line: 63, baseType: !113, size: 32)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "sym_stdin", scope: !675, file: !62, line: 64, baseType: !679, size: 64, offset: 64)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "exe_disk_file_t", file: !62, line: 44, baseType: !681)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !62, line: 40, size: 192, elements: !682)
!682 = !{!683, !684, !685}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !681, file: !62, line: 41, baseType: !113, size: 32)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !681, file: !62, line: 42, baseType: !7, size: 64, offset: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "stat", scope: !681, file: !62, line: 43, baseType: !686, size: 64, offset: 128)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !103, line: 119, size: 1152, elements: !688)
!688 = !{!689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !701, !706, !707, !708}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !687, file: !103, line: 121, baseType: !106, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !687, file: !103, line: 123, baseType: !91, size: 64, offset: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !687, file: !103, line: 124, baseType: !110, size: 64, offset: 128)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !687, file: !103, line: 125, baseType: !112, size: 32, offset: 192)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !687, file: !103, line: 132, baseType: !115, size: 32, offset: 224)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !687, file: !103, line: 133, baseType: !117, size: 32, offset: 256)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !687, file: !103, line: 135, baseType: !45, size: 32, offset: 288)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !687, file: !103, line: 136, baseType: !106, size: 64, offset: 320)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !687, file: !103, line: 137, baseType: !121, size: 64, offset: 384)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !687, file: !103, line: 143, baseType: !123, size: 64, offset: 448)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !687, file: !103, line: 144, baseType: !700, size: 64, offset: 512)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !85, line: 168, baseType: !81)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !687, file: !103, line: 152, baseType: !702, size: 128, offset: 576)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !128, line: 8, size: 128, elements: !703)
!703 = !{!704, !705}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !702, file: !128, line: 10, baseType: !131, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !702, file: !128, line: 11, baseType: !133, size: 64, offset: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !687, file: !103, line: 153, baseType: !702, size: 128, offset: 704)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !687, file: !103, line: 154, baseType: !702, size: 128, offset: 832)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !687, file: !103, line: 164, baseType: !137, size: 192, offset: 960)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "sym_stdout", scope: !675, file: !62, line: 64, baseType: !679, size: 64, offset: 128)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "stdout_writes", scope: !675, file: !62, line: 65, baseType: !113, size: 32, offset: 192)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "sym_files", scope: !675, file: !62, line: 66, baseType: !679, size: 64, offset: 256)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "max_failures", scope: !675, file: !62, line: 69, baseType: !113, size: 32, offset: 320)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "read_fail", scope: !675, file: !62, line: 72, baseType: !531, size: 64, offset: 384)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "write_fail", scope: !675, file: !62, line: 72, baseType: !531, size: 64, offset: 448)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "close_fail", scope: !675, file: !62, line: 72, baseType: !531, size: 64, offset: 512)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "ftruncate_fail", scope: !675, file: !62, line: 72, baseType: !531, size: 64, offset: 576)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "getcwd_fail", scope: !675, file: !62, line: 72, baseType: !531, size: 64, offset: 640)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "chmod_fail", scope: !675, file: !62, line: 73, baseType: !531, size: 64, offset: 704)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "fchmod_fail", scope: !675, file: !62, line: 73, baseType: !531, size: 64, offset: 768)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "exe_sym_env_t", file: !62, line: 89, baseType: !721)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !62, line: 81, size: 6272, elements: !722)
!722 = !{!723, !734, !735, !736}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "fds", scope: !721, file: !62, line: 82, baseType: !724, size: 6144)
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !725, size: 6144, elements: !732)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "exe_file_t", file: !62, line: 60, baseType: !726)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !62, line: 53, size: 192, elements: !727)
!727 = !{!728, !729, !730, !731}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !726, file: !62, line: 54, baseType: !45, size: 32)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !726, file: !62, line: 55, baseType: !113, size: 32, offset: 32)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !726, file: !62, line: 58, baseType: !82, size: 64, offset: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "dfile", scope: !726, file: !62, line: 59, baseType: !679, size: 64, offset: 128)
!732 = !{!733}
!733 = !DISubrange(count: 32)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "umask", scope: !721, file: !62, line: 83, baseType: !165, size: 32, offset: 6144)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !721, file: !62, line: 84, baseType: !113, size: 32, offset: 6176)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "save_all_writes", scope: !721, file: !62, line: 88, baseType: !45, size: 32, offset: 6208)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(name: "locale_mmap", scope: !739, file: !744, line: 11, type: !746, isLocal: true, isDefinition: true)
!739 = distinct !DICompileUnit(language: DW_LANG_C99, file: !740, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !741)
!740 = !DIFile(filename: "./extra/locale/locale_data.c", directory: "/home/strahinja/build/klee-uclibc")
!741 = !{!742, !737}
!742 = !DIGlobalVariableExpression(var: !743, expr: !DIExpression())
!743 = distinct !DIGlobalVariable(name: "__locale_mmap", scope: !739, file: !744, line: 20149, type: !745, isLocal: false, isDefinition: true)
!744 = !DIFile(filename: "extra/locale/locale_data.c", directory: "/home/strahinja/build/klee-uclibc")
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !747)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_mmap_t", file: !748, line: 91, baseType: !749)
!748 = !DIFile(filename: "./extra/locale/locale_mmap.h", directory: "/home/strahinja/build/klee-uclibc")
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !748, line: 31, size: 2047232, elements: !750)
!750 = !{!751, !755, !759, !763, !767, !771, !775, !779, !783, !787, !791, !795, !799, !816, !820, !822, !824, !828, !830, !834, !838, !842, !846, !850, !854, !858, !862, !866, !870, !874, !875, !879, !883, !887, !891, !895}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8ctype", scope: !749, file: !748, line: 37, baseType: !752, size: 3360)
!752 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 3360, elements: !753)
!753 = !{!754}
!754 = !DISubrange(count: 420)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8uplow", scope: !749, file: !748, line: 38, baseType: !756, size: 4032, offset: 3360)
!756 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 4032, elements: !757)
!757 = !{!758}
!758 = !DISubrange(count: 504)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8c2wc", scope: !749, file: !748, line: 40, baseType: !760, size: 28160, offset: 7392)
!760 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 28160, elements: !761)
!761 = !{!762}
!762 = !DISubrange(count: 1760)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8wc2c", scope: !749, file: !748, line: 41, baseType: !764, size: 36224, offset: 35552)
!764 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 36224, elements: !765)
!765 = !{!766}
!766 = !DISubrange(count: 4528)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "tblwctype", scope: !749, file: !748, line: 46, baseType: !768, size: 28832, offset: 71776)
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 28832, elements: !769)
!769 = !{!770}
!770 = !DISubrange(count: 3604)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow", scope: !749, file: !748, line: 47, baseType: !772, size: 13440, offset: 100608)
!772 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 13440, elements: !773)
!773 = !{!774}
!774 = !DISubrange(count: 1680)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow_diff", scope: !749, file: !748, line: 48, baseType: !776, size: 3136, offset: 114048)
!776 = !DICompositeType(tag: DW_TAG_array_type, baseType: !312, size: 3136, elements: !777)
!777 = !{!778}
!778 = !DISubrange(count: 196)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "lc_ctype_data", scope: !749, file: !748, line: 53, baseType: !780, size: 408, offset: 117184)
!780 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 408, elements: !781)
!781 = !{!782}
!782 = !DISubrange(count: 51)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "lc_numeric_data", scope: !749, file: !748, line: 54, baseType: !784, size: 224, offset: 117592)
!784 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 224, elements: !785)
!785 = !{!786}
!786 = !DISubrange(count: 28)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "lc_monetary_data", scope: !749, file: !748, line: 55, baseType: !788, size: 13168, offset: 117816)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 13168, elements: !789)
!789 = !{!790}
!790 = !DISubrange(count: 1646)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "lc_time_data", scope: !749, file: !748, line: 56, baseType: !792, size: 226824, offset: 130984)
!792 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 226824, elements: !793)
!793 = !{!794}
!794 = !DISubrange(count: 28353)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "lc_messages_data", scope: !749, file: !748, line: 58, baseType: !796, size: 14432, offset: 357808)
!796 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 14432, elements: !797)
!797 = !{!798}
!798 = !DISubrange(count: 1804)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "codeset_8_bit", scope: !749, file: !748, line: 62, baseType: !800, size: 15824, offset: 372240)
!800 = !DICompositeType(tag: DW_TAG_array_type, baseType: !801, size: 15824, elements: !814)
!801 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !802)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "__codeset_8_bit_t", file: !803, line: 21, baseType: !804)
!803 = !DIFile(filename: "./extra/locale/c8tables.h", directory: "/home/strahinja/build/klee-uclibc")
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !803, line: 16, size: 688, elements: !805)
!805 = !{!806, !808, !809, !810}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "idx8ctype", scope: !804, file: !803, line: 17, baseType: !807, size: 128)
!807 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 128, elements: !450)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "idx8uplow", scope: !804, file: !803, line: 18, baseType: !807, size: 128, offset: 128)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "idx8c2wc", scope: !804, file: !803, line: 19, baseType: !807, size: 128, offset: 256)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "idx8wc2c", scope: !804, file: !803, line: 20, baseType: !811, size: 304, offset: 384)
!811 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 304, elements: !812)
!812 = !{!813}
!813 = !DISubrange(count: 38)
!814 = !{!815}
!815 = !DISubrange(count: 23)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "lc_ctype_rows", scope: !749, file: !748, line: 65, baseType: !817, size: 160, offset: 388064)
!817 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 160, elements: !818)
!818 = !{!819}
!819 = !DISubrange(count: 20)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "lc_ctype_item_offsets", scope: !749, file: !748, line: 65, baseType: !821, size: 160, offset: 388224)
!821 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 160, elements: !297)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "lc_ctype_item_idx", scope: !749, file: !748, line: 65, baseType: !823, size: 320, offset: 388384)
!823 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 320, elements: !818)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "lc_numeric_rows", scope: !749, file: !748, line: 66, baseType: !825, size: 360, offset: 388704)
!825 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 360, elements: !826)
!826 = !{!827}
!827 = !DISubrange(count: 45)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "lc_numeric_item_offsets", scope: !749, file: !748, line: 66, baseType: !829, size: 48, offset: 389072)
!829 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 48, elements: !138)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "lc_numeric_item_idx", scope: !749, file: !748, line: 66, baseType: !831, size: 240, offset: 389120)
!831 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 240, elements: !832)
!832 = !{!833}
!833 = !DISubrange(count: 15)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "lc_monetary_rows", scope: !749, file: !748, line: 67, baseType: !835, size: 31152, offset: 389360)
!835 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 31152, elements: !836)
!836 = !{!837}
!837 = !DISubrange(count: 3894)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "lc_monetary_item_offsets", scope: !749, file: !748, line: 67, baseType: !839, size: 352, offset: 420512)
!839 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 352, elements: !840)
!840 = !{!841}
!841 = !DISubrange(count: 22)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "lc_monetary_item_idx", scope: !749, file: !748, line: 67, baseType: !843, size: 6512, offset: 420864)
!843 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 6512, elements: !844)
!844 = !{!845}
!845 = !DISubrange(count: 407)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "lc_time_rows", scope: !749, file: !748, line: 68, baseType: !847, size: 66000, offset: 427376)
!847 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 66000, elements: !848)
!848 = !{!849}
!849 = !DISubrange(count: 8250)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "lc_time_item_offsets", scope: !749, file: !748, line: 68, baseType: !851, size: 800, offset: 493376)
!851 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 800, elements: !852)
!852 = !{!853}
!853 = !DISubrange(count: 50)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "lc_time_item_idx", scope: !749, file: !748, line: 68, baseType: !855, size: 54864, offset: 494176)
!855 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 54864, elements: !856)
!856 = !{!857}
!857 = !DISubrange(count: 3429)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "lc_messages_rows", scope: !749, file: !748, line: 70, baseType: !859, size: 2976, offset: 549040)
!859 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 2976, elements: !860)
!860 = !{!861}
!861 = !DISubrange(count: 372)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "lc_messages_item_offsets", scope: !749, file: !748, line: 70, baseType: !863, size: 64, offset: 552016)
!863 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 64, elements: !864)
!864 = !{!865}
!865 = !DISubrange(count: 4)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "lc_messages_item_idx", scope: !749, file: !748, line: 70, baseType: !867, size: 3200, offset: 552080)
!867 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 3200, elements: !868)
!868 = !{!869}
!869 = !DISubrange(count: 200)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "collate_data", scope: !749, file: !748, line: 72, baseType: !871, size: 1458256, offset: 555280)
!871 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 1458256, elements: !872)
!872 = !{!873}
!873 = !DISubrange(count: 91141)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "lc_common_item_offsets_LEN", scope: !749, file: !748, line: 74, baseType: !292, size: 48, offset: 2013536)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "lc_common_tbl_offsets", scope: !749, file: !748, line: 75, baseType: !876, size: 1536, offset: 2013632)
!876 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 1536, elements: !877)
!877 = !{!878}
!878 = !DISubrange(count: 24)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "locales", scope: !749, file: !748, line: 80, baseType: !880, size: 22608, offset: 2015168)
!880 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 22608, elements: !881)
!881 = !{!882}
!882 = !DISubrange(count: 2826)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "locale_names5", scope: !749, file: !748, line: 81, baseType: !884, size: 6680, offset: 2037776)
!884 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 6680, elements: !885)
!885 = !{!886}
!886 = !DISubrange(count: 835)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "locale_at_modifiers", scope: !749, file: !748, line: 82, baseType: !888, size: 144, offset: 2044456)
!888 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 144, elements: !889)
!889 = !{!890}
!890 = !DISubrange(count: 18)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "lc_names", scope: !749, file: !748, line: 85, baseType: !892, size: 552, offset: 2044600)
!892 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 552, elements: !893)
!893 = !{!894}
!894 = !DISubrange(count: 69)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "codeset_list", scope: !749, file: !748, line: 87, baseType: !896, size: 2040, offset: 2045152)
!896 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 2040, elements: !897)
!897 = !{!898}
!898 = !DISubrange(count: 255)
!899 = !DIGlobalVariableExpression(var: !900, expr: !DIExpression())
!900 = distinct !DIGlobalVariable(name: "__C_ctype_b_data", scope: !901, file: !906, line: 471, type: !907, isLocal: false, isDefinition: true)
!901 = distinct !DICompileUnit(language: DW_LANG_C99, file: !902, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !903)
!902 = !DIFile(filename: "libc/misc/ctype/__C_ctype_b.c", directory: "/home/strahinja/build/klee-uclibc")
!903 = !{!899, !904}
!904 = !DIGlobalVariableExpression(var: !905, expr: !DIExpression())
!905 = distinct !DIGlobalVariable(name: "__C_ctype_b", scope: !901, file: !906, line: 862, type: !263, isLocal: false, isDefinition: true)
!906 = !DIFile(filename: "libc/misc/ctype/ctype.c", directory: "/home/strahinja/build/klee-uclibc")
!907 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 6144, elements: !278)
!908 = !DIGlobalVariableExpression(var: !909, expr: !DIExpression())
!909 = distinct !DIGlobalVariable(name: "__C_ctype_tolower_data", scope: !910, file: !906, line: 878, type: !915, isLocal: false, isDefinition: true)
!910 = distinct !DICompileUnit(language: DW_LANG_C99, file: !911, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !912)
!911 = !DIFile(filename: "libc/misc/ctype/__C_ctype_tolower.c", directory: "/home/strahinja/build/klee-uclibc")
!912 = !{!908, !913}
!913 = !DIGlobalVariableExpression(var: !914, expr: !DIExpression())
!914 = distinct !DIGlobalVariable(name: "__C_ctype_tolower", scope: !910, file: !906, line: 981, type: !270, isLocal: false, isDefinition: true)
!915 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 6144, elements: !278)
!916 = !DIGlobalVariableExpression(var: !917, expr: !DIExpression())
!917 = distinct !DIGlobalVariable(name: "__C_ctype_toupper_data", scope: !918, file: !906, line: 1000, type: !915, isLocal: false, isDefinition: true)
!918 = distinct !DICompileUnit(language: DW_LANG_C99, file: !919, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !920)
!919 = !DIFile(filename: "libc/misc/ctype/__C_ctype_toupper.c", directory: "/home/strahinja/build/klee-uclibc")
!920 = !{!916, !921}
!921 = !DIGlobalVariableExpression(var: !922, expr: !DIExpression())
!922 = distinct !DIGlobalVariable(name: "__C_ctype_toupper", scope: !918, file: !906, line: 1103, type: !270, isLocal: false, isDefinition: true)
!923 = !DIGlobalVariableExpression(var: !924, expr: !DIExpression())
!924 = distinct !DIGlobalVariable(name: "errno", scope: !925, file: !926, line: 7, type: !45, isLocal: false, isDefinition: true)
!925 = distinct !DICompileUnit(language: DW_LANG_C99, file: !926, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !927)
!926 = !DIFile(filename: "libc/misc/internals/errno.c", directory: "/home/strahinja/build/klee-uclibc")
!927 = !{!923, !928}
!928 = !DIGlobalVariableExpression(var: !929, expr: !DIExpression())
!929 = distinct !DIGlobalVariable(name: "h_errno", scope: !925, file: !926, line: 8, type: !45, isLocal: false, isDefinition: true)
!930 = !DIGlobalVariableExpression(var: !931, expr: !DIExpression())
!931 = distinct !DIGlobalVariable(name: "error_message_count", scope: !932, file: !933, line: 40, type: !113, isLocal: false, isDefinition: true)
!932 = distinct !DICompileUnit(language: DW_LANG_C99, file: !933, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !657, globals: !934)
!933 = !DIFile(filename: "libc/misc/error/error.c", directory: "/home/strahinja/build/klee-uclibc")
!934 = !{!930, !935, !940, !942}
!935 = !DIGlobalVariableExpression(var: !936, expr: !DIExpression())
!936 = distinct !DIGlobalVariable(name: "old_file_name", scope: !937, file: !933, line: 76, type: !29, isLocal: true, isDefinition: true)
!937 = distinct !DISubprogram(name: "__error_at_line", scope: !933, file: !933, line: 70, type: !938, isLocal: false, isDefinition: true, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: false, unit: !932, variables: !4)
!938 = !DISubroutineType(types: !939)
!939 = !{null, !45, !45, !29, !113, !29, null}
!940 = !DIGlobalVariableExpression(var: !941, expr: !DIExpression())
!941 = distinct !DIGlobalVariable(name: "old_line_number", scope: !937, file: !933, line: 77, type: !113, isLocal: true, isDefinition: true)
!942 = !DIGlobalVariableExpression(var: !943, expr: !DIExpression())
!943 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !932, file: !933, line: 43, type: !45, isLocal: false, isDefinition: true)
!944 = !DIGlobalVariableExpression(var: !945, expr: !DIExpression())
!945 = distinct !DIGlobalVariable(name: "hr_locale", scope: !946, file: !213, line: 194, type: !952, isLocal: true, isDefinition: true)
!946 = distinct !DICompileUnit(language: DW_LANG_C99, file: !947, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !948, globals: !949)
!947 = !DIFile(filename: "libc/misc/locale/setlocale.c", directory: "/home/strahinja/build/klee-uclibc")
!948 = !{!113, !6, !45}
!949 = !{!944, !950}
!950 = !DIGlobalVariableExpression(var: !951, expr: !DIExpression())
!951 = distinct !DIGlobalVariable(name: "utf8", scope: !946, file: !213, line: 186, type: !444, isLocal: true, isDefinition: true)
!952 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 3584, elements: !953)
!953 = !{!954}
!954 = !DISubrange(count: 448)
!955 = !DIGlobalVariableExpression(var: !956, expr: !DIExpression())
!956 = distinct !DIGlobalVariable(name: "__evoke_link_warning___fpending", scope: !957, file: !958, line: 24, type: !960, isLocal: true, isDefinition: true)
!957 = distinct !DICompileUnit(language: DW_LANG_C99, file: !958, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !959)
!958 = !DIFile(filename: "libc/stdio/__fpending.c", directory: "/home/strahinja/build/klee-uclibc")
!959 = !{!955}
!960 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 1336, elements: !961)
!961 = !{!962}
!962 = !DISubrange(count: 167)
!963 = !DIGlobalVariableExpression(var: !964, expr: !DIExpression())
!964 = distinct !DIGlobalVariable(name: "buf", scope: !965, file: !966, line: 90, type: !983, isLocal: true, isDefinition: true)
!965 = distinct !DISubprogram(name: "strsignal", scope: !966, file: !966, line: 86, type: !967, isLocal: false, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: false, unit: !969, variables: !4)
!966 = !DIFile(filename: "libc/string/strsignal.c", directory: "/home/strahinja/build/klee-uclibc")
!967 = !DISubroutineType(types: !968)
!968 = !{!7, !45}
!969 = distinct !DICompileUnit(language: DW_LANG_C99, file: !966, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !970, retainedTypes: !978, globals: !979)
!970 = !{!971}
!971 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !972, line: 79, size: 32, elements: !973)
!972 = !DIFile(filename: "./include/bits/uClibc_uintmaxtostr.h", directory: "/home/strahinja/build/klee-uclibc")
!973 = !{!974, !975, !976, !977}
!974 = !DIEnumerator(name: "__UIM_DECIMAL", value: 0)
!975 = !DIEnumerator(name: "__UIM_GROUP", value: 44)
!976 = !DIEnumerator(name: "__UIM_LOWER", value: 87)
!977 = !DIEnumerator(name: "__UIM_UPPER", value: 55)
!978 = !{!113, !7}
!979 = !{!963, !980}
!980 = !DIGlobalVariableExpression(var: !981, expr: !DIExpression())
!981 = distinct !DIGlobalVariable(name: "unknown", scope: !965, file: !966, line: 91, type: !982, isLocal: true, isDefinition: true)
!982 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 120, elements: !832)
!983 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 216, elements: !984)
!984 = !{!985}
!985 = !DISubrange(count: 27)
!986 = !DIGlobalVariableExpression(var: !987, expr: !DIExpression())
!987 = distinct !DIGlobalVariable(name: "optind", scope: !988, file: !989, line: 152, type: !45, isLocal: false, isDefinition: true)
